{"id":9355,"date":"2016-07-28T12:51:23","date_gmt":"2016-07-28T17:51:23","guid":{"rendered":"http:\/\/aaronallen.com\/?p=9355"},"modified":"2021-05-20T17:41:22","modified_gmt":"2021-05-20T22:41:22","slug":"cost-of-opening-restaurant","status":"publish","type":"post","link":"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant","title":{"rendered":"How Much Does it Cost to Open a Restaurant?"},"content":{"rendered":"<p>One of the most common restaurant start-up mistakes is underestimating the capital budget requirements involved in opening a restaurant. And one of the most common questions we&#8217;re asked is: &#8220;How much does it cost to open a restaurant?&#8221;<\/p>\n<p>Here, we hope to provide some rules of thumb and average costs and ranges, as well as identify common hidden costs that can be the cause of not only headaches and budget shortfalls, but that also contribute to restaurant fatality rates.<\/p>\n<p>Delays in opening from complications with permitting, scheduling, hiring, improperly estimating lead times on equipment and delivery, sequencing of build-out and installation can all contribute to additional costs. And the burn-rate on cash (between rent, management, line-level employees, utilities, and the cost of capital) can quickly drain and deplete the budgets before the restaurant is even opened.<\/p>\n<p>When planning to open, a restaurateur has to find, screen, hire, enroll\/inform, manage, and maintain relationships with an army of help including a minimum of the following specialized disciplines:<br \/>\n<a href=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2016\/07\/Restaurant-Opening-Positions.png\"><img loading=\"lazy\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2016\/07\/Restaurant-Opening-Positions.png\" alt=\"Restaurant Opening Positions\" width=\"966\" height=\"308\" \/><\/a><\/p>\n<p>The average restaurant could easily have 100+ different supplier companies and active accounts. For every one of the items in the list above, restaurateurs can be paying anywhere from $100 a month to $800 an hour.  And that’s before all of the free accounts that need to be managed, like Twitter, Facebook, Instagram, Vine, Google+, TripAdvisor, Yelp! and whatever else is hot-button (not to mention the countless trade publication subscriptions to be keeping up with). Brilliant <a href=\"https:\/\/aaronallen.com\/restaurant-strategy\">restaurant strategy<\/a> requires blending the art and science combined with impeccable preparation, skill, and timing.<\/p>\n<h2>SO WHAT IS THE COST TO OPEN A RESTAURANT?<\/h2>\n<p>Naturally, costs and revenues vary by category, concept, cuisine, geography, and the economies of the business and entrepreneur. Typical restaurant build-out costs range between $150 &#8211; $750 per square foot, depending on the quality of materials used, construction costs, and other factors. The total investment (excluding land and soft costs) usually ranges between $250,000 &#8211; $2.5 million, and the average size ranges between 1,200 &#8211; 10,000 square feet.<\/p>\n<p>Here are some averages for major restaurant companies, and the distribution of their opening costs.<\/p>\n<p><img loading=\"lazy\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2016\/07\/Restaurant-Opening-Costs.png\" alt=\"Cost of Opening a Restaurant\" width=\"936\" height=\"408\" \/><\/p>\n<p>The average restaurant operates with sales per square foot of $513.70. The average cost to build of $404 per square foot includes just the build-out cost. Some of the other costs that often go underestimated (or in the worst cases, forgotten) include the following items (and hundreds more scattered across more than a dozen cost categories).<\/p>\n<h3>FURNITURE, FIXTURES &amp; EQUIPMENT<\/h3>\n<p>Typically, 30–40% of the total hard cost budget is allocated to furniture, fixtures and equipment (FF&amp;E),  with the rest of the budget being distributed among construction\/leasehold improvements (40–60%) and contingency (10–15%). On average, 10–20% of the total FF&amp;E costs is allocated to design and architecture fees.<\/p>\n<p>As an example, a decent commercial chair is going to cost at least $80 (in most cases). In a luxury restaurant, it wouldn’t be unheard of to see those as high as $800. That multiplied out by a 100 seat restaurant adds up very quickly.<\/p>\n<h3>MENUS<\/h3>\n<p>Printed menus can range from only about $5 each from the local print shop, to as much as $300 per menu with sturdy binding and intricate inlays. Assuming a 200-seat restaurant (a good rule of thumb is to order 1.5 times menus as there are seats), that could be close to $90,000 in menu printing costs (which will have to be replaced periodically, too).<\/p>\n<p>This is one of the contributing factors as to why you don’t see a lot of fine dining restaurant chains – as those expenses are better suited for one-off restaurants and the celebrity-chef features in high-end markets. It’s also a reason why the trend of investment in restaurants is geared more toward fast-casual concepts and those that have lower capital requirements and higher sales to investment ratios.<\/p>\n<p>Sales-to-investment ratio is a key metric for investors when considering opening a restaurant. Here’s a quick overview of McDonald’s sales to investment performance over time.<\/p>\n<p><a href=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2016\/07\/McDonalds-Sales-to-Investment-Ratio.png\"><img loading=\"lazy\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2016\/07\/McDonalds-Sales-to-Investment-Ratio.png\" alt=\"McDonald's Sales to Investment Ratio\" width=\"975\" height=\"266\" \/><\/a><\/p>\n<h3>PRE-OPENING EXPENSES<\/h3>\n<p>To develop all of the recipes for testing, either a temporary kitchen or rented equipment will be required – how else could the menu be developed and properly tested, if not on the actual equipment set up? And while a chef won’t fail in the development of each new menu item as much as Thomas Edison did when inventing the light bulb, rest assured he won’t get it right on the first try. Money in inventory is necessary before selling any food just to get the menu perfected.<\/p>\n<p>Restaurants are in cash-burn situation for months (or up to years, if not executed properly). Before a dollar can be collected in revenue, a considerable sum will be spent in capitalized operating expenses. Expect at least a few months’ worth of pre-opening rent, labor, and utilities. But this can also get tricky, as we’ve seen unexpected delays for operators that can push back openings by an extra four to six months, easily. That might not sound like much, but on a percentage basis for the pre-opening expenses budget, it can be an increase of as much as 300%.<\/p>\n<p>Grand opening expenses would also fall in this category. While an opening can cost as little as a balloon and some ribbon out front to let customers know the restaurant is open, we’ve also helped support restaurants who had dedicated grand opening budgets of more than $100,000 (granted, most restaurants also don’t need $1 million in Venini glass separating the restrooms, either). Usually, for the first year of operation we recommend a marketing budget of 6% of anticipated sales. Of that budget, 30% is recommended to be allocated to pre-opening marketing.<\/p>\n<h3>TECHNOLOGY<\/h3>\n<p>Increasingly in the modern age, technology is being utilized in an enhanced capacity for not only marketing but also greater efficiency (i.e., replacement of labor), convenience, and increasing analytics and visibility into the business performance. Technology in restaurants can take on many forms, including:<\/p>\n<ul>\n<li>WEB SITE: A website can be anywhere from free (on sites like wix.com for the do-it-yourselfer) to $350K+, depending on integrations with other technology (back-end functionality for on-line ordering, social engagement, mobile, etc.), the agency that builds it, and other costs required to get people to visit in the first place. Depending on the type of concept, some of these investments relate to a competitive advantage in not just marketing but operational capabilities as well.<\/li>\n<li>POINT OF SALE SYSTEM: A point of sale system (POS) could be anywhere from a cloud-based, tablet-style system for as little as $99 per month, up to Legacy POS installations which can go as high as $50,000 &#8211; $60,000 per location (and need to be updated or replaced every 5 &#8211; 7 years).<\/li>\n<li>DEPENDING ON THE STYLE OF CONCEPT: Additional technology investments may be necessary, depending on the type of restaurant being opened. Everything from ERP Systems to revenue management software to digital menu boards can fall into this category.<\/li>\n<\/ul>\n<p>For these items, cost is not driven solely by the hard cost of acquiring and installing these technologies, often – more substantially – it’s driven by the soft cost of skilled and experienced internal personnel or external experts who help properly define the business and technical requirements and guide and ensure proper implementation, execution, monitoring, and reporting.<\/p>\n<p>Just as the fryer does most of the work during the cooking process, there still needs to be someone there to push the buttons (meaning that, with almost everything going in, it’s driven by people, process, and intellectual property – whether that is cheap, valuable, bought, or rented).<\/p>\n<h2>TIMING, TECHNICAL REQUIREMENTS, AND KNOWING WHAT TO DO WHEN DEVELOPING A BUSINESS PLAN<\/h2>\n<p>A business plan is all too often either an afterthought or conjures up the mental image of a clunky fill-in-the-blank form on the Internet or an antiquated piece of software that asks you questions like “What is your Vision?” or prompts about writing your Mission Statement (which are almost inevitably filled in with something generic and uninspired, along the lines of “to offer good food, good service, good atmosphere”).<\/p>\n<p>Many operators gloss over it and skip to the financial tables in the appendix. But all of the items listed in this article, and the hundreds (if not thousands) more details that go into opening a restaurant will have a (hard or soft) cost that is often missed or skipped. These costs need to be considered in the business planning process before any heavy investments are made in other capital costs.<\/p>\n<h2>UNDERESTIMATION OF SOFT COSTS<\/h2>\n<p>The biggest shortfall in the budgets often relate to the soft costs of development. Even some of the most experienced operators who have opened dozens or hundreds of restaurant locations are often at a loss for words when asked: “How much does a new restaurant prototype cost to develop?”<\/p>\n<p>By our estimate, no less than 10,000 man-hours of development must go into creating a restaurant – whether that’s free labor from the entrepreneurs donating their time to the cause, inexpensive hourly labor who’s inexperienced in the development of prototypes, or highly experienced professionals who cost more upfront (but are more likely to get it done right the first time and save more on the back end). A lot goes into developing standards and specifications, and documenting those — a step that’s often skipped when in a hurry to get the place open.<\/p>\n<p>Being accurate from the start on <a href=\"https:\/\/aaronallen.com\/restaurant-finance\">restaurant finance<\/a> projections is critical — otherwise, it&#8217;s like a plane flying two degrees off course every minute of the flight. It will never reach the target destination.<\/p>\n<h3 style=\"padding-left: 60px;\">INTELLECTUAL PROPERTY IS WALKING OUT THE DOOR<\/h3>\n<p style=\"padding-left: 60px;\"><img loading=\"lazy\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2016\/07\/Money-Drain.png\" alt=\"\" width=\"154\" height=\"233\" \/>Once restaurant turnover rates kick in (which is often a surprise for those outside of the industry, as the average turnover is 100% for most concepts, and for quick service restaurants (QSRs) can be as high as 300%), the intellectual property walks out the door with the employees. The documentation of standards, specifications, policies, procedures, and replicable training protocols was simply in their head and created organically, rather than formalized during the business development.<\/p>\n<p style=\"padding-left: 60px;\">The development of training programs is rarely listed as a line item on a restaurant start-up budget (again, even for highly experienced operators). Training costs for start-ups usually just include the cost of recruitment and the dollar amount of the hourly crew members who are being trained.<\/p>\n<p style=\"padding-left: 60px;\">But there needs to be something the employees are being trained <em>on<\/em>. This means the standards, specifications, proprietary processes, and intellectual property need to be developed by someone. While free to low-cost templates are available on the Internet as a way to save money, making the investment upfront will yield higher returns on the back end. Most companies pinch pennies on the planning and often pay for it with a pound of flesh in run-rate performance drag.<\/p>\n<h2>GOOD RESTAURANTS CAN GO OUT OF BUSINESS, TOO<\/h2>\n<p>We’ve seen (in several instances) a restaurant become very successful after the first 3 &#8211; 4 months of opening be closed by month six. The reason being, due to underinvesting in pre-opening expenses and marketing, starting with slower-than-projected rates. As such, they begin to get behind on supplier bills and deplete their reserves.<\/p>\n<p>Although they were successful and the once-empty restaurant was packed by month four, it was completely empty by month six and rented to someone else by month eight (who got all of the free equipment forfeited by the previous tenant who didn’t sharpen their pencils well enough in the development of their financial estimates, business plan, and capital budgets).<\/p>\n<h2>MAKING THE LEAP<\/h2>\n<p>We get it. If most restaurateurs and entrepreneurs knew what all was going to be involved before they made the leap, they wouldn’t do it in the first place. Some land in a lush flowerbed or splash into a crisp, cool ocean while others go splat on the rocks. But it’s not the action of jumping off the cliff; it has more to do with looking carefully and jumping off at the right spot at the right time.<\/p>\n<p>Darden, the parent company of Seasons 52, reportedly invested $20 million into the prototype before the first location even opened. If restaurants cost $20 million before they open, few – if any – of them ever would. Darden, though, won’t invest in a concept unless they believe it has the potential to be a $1billion company. In that case, it makes sense to invest $20 million into a prototype that will be replicated hundreds, and bake the efficiencies in, rather than bleeding out all of that lost profit potential replicating a less-than-perfect model.<\/p>\n<p>For most restaurants, if they spent what they needed to get everything right in the beginning, almost none of them would pursue opening a restaurant; but if more restaurants that did start had invested what they needed upfront, fewer of them would have closed.<\/p>\n<h2>PLAN AHEAD<\/h2>\n<p>The business plan should be allocated as a percentage of the overall capital investment (including hard and soft costs) for the development of professional feasibility study, business plan and professional guidance as it relates to brand strategy, location strategy, understanding the market and competitive dynamics, study of the trading area, financial models, and more (including, in some cases, support with the development and presentation of investor proposals and pitches).<\/p>\n<p>The best restaurants are like timing a soufflé to the crescendo of an orchestra. Yet most seem like the output of a plastic bag full of groceries and candies melted together in the microwave. If we haven’t talked you out of opening a restaurant, hopefully we’ve talked you in to taking your plans out of the microwave and putting them on simmer in a nice sauce pan.<\/p>\n<h3>About Aaron Allen &amp; Associates<\/h3>\n<p><a href=\"http:\/\/aaronallen.com\/\">Aaron Allen &amp; Associates<\/a> works with leaders of global foodservice and hospitality companies on strategic issues related to growing and optimizing performance and value. Specializations of the firm include multinational expansion, system-wide sales building, brand and portfolio strategy, modernized marketing, industry trends, technology, and advanced analytics. Aaron has personally led more than 2,000 client engagements spanning six continents and 100+ countries for companies collectively posting annual revenues exceeding $200 billion.<\/p>\n<h2>Ready to Open a Restaurant?<\/h2>\n<p>We Help Stack the Odds In Your Favor<br \/>\n<a href=\"https:\/\/aaronallen.com\/opening-a-restaurant\"><br \/>\nLearn More <\/a><\/p>\n","protected":false},"excerpt":{"rendered":"<p>One of the most common restaurant start-up mistakes is underestimating the capital budget requirements involved in opening a restaurant. And one of the most common questions we&#8217;re asked is: &#8220;How much does it cost to open a restaurant?&#8221; Here, we hope to provide some rules of thumb and average costs and ranges, as well as &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;How Much Does it Cost to Open a Restaurant?&#8221;<\/span><\/a><\/p>\n","protected":false},"author":40,"featured_media":14449,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[1,7571],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.2 (Yoast SEO v19.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How Much Does it (Really) Cost to Open a Restaurant?<\/title>\n<meta name=\"description\" content=\"One of the most common questions we&#039;re asked is how much it costs to open a restaurant — and a common start-up mistake is underestimating capital needs.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How Much Does it Cost to Open a Restaurant?\" \/>\n<meta property=\"og:description\" content=\"One of the most common restaurant start-up mistakes is underestimating the capital budget requirements involved in opening a restaurant. And one of the\" \/>\n<meta property=\"og:url\" content=\"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant\" \/>\n<meta property=\"og:site_name\" content=\"Aaron Allen &amp; Associates, Global Restaurant Consultants\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/\" \/>\n<meta property=\"article:published_time\" content=\"2016-07-28T17:51:23+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2021-05-20T22:41:22+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2016\/07\/how-much-does-it-cost-to-open-a-restaurant.png\" \/>\n\t<meta property=\"og:image:width\" content=\"1314\" \/>\n\t<meta property=\"og:image:height\" content=\"434\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/png\" \/>\n<meta name=\"author\" content=\"Aaron Allen\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@QMG\" \/>\n<meta name=\"twitter:site\" content=\"@QMG\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Aaron Allen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"12 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant#article\",\"isPartOf\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant\"},\"author\":{\"name\":\"Aaron Allen\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21\"},\"headline\":\"How Much Does it Cost to Open a Restaurant?\",\"datePublished\":\"2016-07-28T17:51:23+00:00\",\"dateModified\":\"2021-05-20T22:41:22+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant\"},\"wordCount\":2340,\"publisher\":{\"@id\":\"https:\/\/aaronallen.com\/#organization\"},\"articleSection\":[\"Insights\",\"Restaurant Operations\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant\",\"url\":\"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant\",\"name\":\"How Much Does it (Really) Cost to Open a Restaurant?\",\"isPartOf\":{\"@id\":\"https:\/\/aaronallen.com\/#website\"},\"datePublished\":\"2016-07-28T17:51:23+00:00\",\"dateModified\":\"2021-05-20T22:41:22+00:00\",\"description\":\"One of the most common questions we're asked is how much it costs to open a restaurant — and a common start-up mistake is underestimating capital needs.\",\"breadcrumb\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Aaron Allen\",\"item\":\"https:\/\/aaronallen.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Insights\",\"item\":\"https:\/\/aaronallen.com\/blog\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"How Much Does it Cost to Open a Restaurant?\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/aaronallen.com\/#website\",\"url\":\"https:\/\/aaronallen.com\/\",\"name\":\"Aaron Allen & Associates | Global Restaurant Consultants\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/aaronallen.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/aaronallen.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/aaronallen.com\/#organization\",\"name\":\"Aaron Allen & Associates\",\"url\":\"https:\/\/aaronallen.com\/\",\"sameAs\":[\"https:\/\/www.linkedin.com\/company\/aaron-allen-&amp;-associates\",\"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/\",\"https:\/\/twitter.com\/QMG\"],\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png\",\"contentUrl\":\"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png\",\"width\":1247,\"height\":250,\"caption\":\"Aaron Allen & Associates\"},\"image\":{\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21\",\"name\":\"Aaron Allen\",\"sameAs\":[\"http:\/\/aaronallen.com\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"How Much Does it (Really) Cost to Open a Restaurant?","description":"One of the most common questions we're asked is how much it costs to open a restaurant — and a common start-up mistake is underestimating capital needs.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant","og_locale":"en_US","og_type":"article","og_title":"How Much Does it Cost to Open a Restaurant?","og_description":"One of the most common restaurant start-up mistakes is underestimating the capital budget requirements involved in opening a restaurant. And one of the","og_url":"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant","og_site_name":"Aaron Allen &amp; Associates, Global Restaurant Consultants","article_publisher":"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/","article_published_time":"2016-07-28T17:51:23+00:00","article_modified_time":"2021-05-20T22:41:22+00:00","og_image":[{"width":1314,"height":434,"url":"https:\/\/aaronallen.com\/wp-content\/uploads\/2016\/07\/how-much-does-it-cost-to-open-a-restaurant.png","type":"image\/png"}],"author":"Aaron Allen","twitter_card":"summary_large_image","twitter_creator":"@QMG","twitter_site":"@QMG","twitter_misc":{"Written by":"Aaron Allen","Est. reading time":"12 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant#article","isPartOf":{"@id":"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant"},"author":{"name":"Aaron Allen","@id":"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21"},"headline":"How Much Does it Cost to Open a Restaurant?","datePublished":"2016-07-28T17:51:23+00:00","dateModified":"2021-05-20T22:41:22+00:00","mainEntityOfPage":{"@id":"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant"},"wordCount":2340,"publisher":{"@id":"https:\/\/aaronallen.com\/#organization"},"articleSection":["Insights","Restaurant Operations"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant","url":"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant","name":"How Much Does it (Really) Cost to Open a Restaurant?","isPartOf":{"@id":"https:\/\/aaronallen.com\/#website"},"datePublished":"2016-07-28T17:51:23+00:00","dateModified":"2021-05-20T22:41:22+00:00","description":"One of the most common questions we're asked is how much it costs to open a restaurant — and a common start-up mistake is underestimating capital needs.","breadcrumb":{"@id":"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/aaronallen.com\/blog\/cost-of-opening-restaurant#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Aaron Allen","item":"https:\/\/aaronallen.com\/"},{"@type":"ListItem","position":2,"name":"Insights","item":"https:\/\/aaronallen.com\/blog"},{"@type":"ListItem","position":3,"name":"How Much Does it Cost to Open a Restaurant?"}]},{"@type":"WebSite","@id":"https:\/\/aaronallen.com\/#website","url":"https:\/\/aaronallen.com\/","name":"Aaron Allen & Associates | Global Restaurant Consultants","description":"","publisher":{"@id":"https:\/\/aaronallen.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/aaronallen.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/aaronallen.com\/#organization","name":"Aaron Allen & Associates","url":"https:\/\/aaronallen.com\/","sameAs":["https:\/\/www.linkedin.com\/company\/aaron-allen-&amp;-associates","https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/","https:\/\/twitter.com\/QMG"],"logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/","url":"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png","contentUrl":"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png","width":1247,"height":250,"caption":"Aaron Allen & Associates"},"image":{"@id":"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21","name":"Aaron Allen","sameAs":["http:\/\/aaronallen.com"]}]}},"jetpack_featured_media_url":"https:\/\/aaronallen.com\/wp-content\/uploads\/2016\/07\/how-much-does-it-cost-to-open-a-restaurant.png","amp_enabled":true,"_links":{"self":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts\/9355"}],"collection":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/users\/40"}],"replies":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/comments?post=9355"}],"version-history":[{"count":0,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts\/9355\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/media\/14449"}],"wp:attachment":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/media?parent=9355"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/categories?post=9355"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/tags?post=9355"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}