{"id":9542,"date":"2017-02-15T11:44:36","date_gmt":"2017-02-15T16:44:36","guid":{"rendered":"http:\/\/aaronallen.com\/?p=9542"},"modified":"2022-07-29T12:30:56","modified_gmt":"2022-07-29T17:30:56","slug":"restaurant-robots-replace-workers","status":"publish","type":"post","link":"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers","title":{"rendered":"A Robot Wants Your Job: How Automation Will Transform Foodservice"},"content":{"rendered":"<p>The would-be U.S. Secretary of Labor can’t wait to see you replaced with a robot.<\/p>\n<p>Who could blame him? He has several good points.<\/p>\n<p>Robots never call in sick. They never complain. They work 24\/7 for pennies on the dollar. They’re as eager to please as any programmer can dream up and they think as fast as a calculator (and hardly muse it as a miracle when they do). Science Fiction has long warned that robot overlords are in the future anyway. So, why not use them to replace one of the largest, most under-skilled, under-motivated, and difficult-to-deal with swaths of the workforce, all while simultaneously reducing costs and heralding in the next industrial revolution — one that’s as good for society as it is for shareholders?<\/p>\n<p>Robots and automation make a lot of sense for restaurants, an industry filled with players who are struggling to remain relevant and find themselves bogged down by high labor costs. Certain facets — like healthcare and the automotive industry — have been utilizing robotic automation for decades, to great success. The restaurant industry has been slower to get on board but, steadily, we’ve begun to welcome our robot overlords, too (or, at least, our robot co-workers). But will restaurant robots replace workers?<\/p>\n<p>The one constant in life, and in business, is change. Restaurant operators are finding themselves at a fork in the road: bring technology into the business or have technology thrust on them.<\/p>\n<p>Automation has generated enormous hype for its potential to transform every facet of the restaurant business. We aren’t quite there yet, but several chains are making strides.<\/p>\n<h2>Automation Could Save Quick Service Restaurants $12.2 Billion in Annual Wages in the U.S. Alone<\/h2>\n<p><a href=\"https:\/\/aaronallen.com\/blog\/restaurant-robotics\">Restaurant robotics<\/a> helps reduce redundancies and inefficiencies that undermine productivity and profitability. A National Robotics Education Foundation study found that the average QSR establishment can shift 1.2 workers from counter service to other tasks as remote order taking and other functions are taken over by robotic applications. That switch equates to an approximate savings of $12.2 billion in annual wages across the U.S. This figure would be slightly offset by the investment in robotic technology up front (assuming 600,000 kiosks require an average investment of $10,000 each), but the total net savings still would exceed $6 billion in just the first year.<\/p>\n<p>Tech&#8217;s powerful impact on cost and productivity is already clear in other industries. Innovations like the cotton gin and the tractor not only made agricultural work easier, but also increased productivity. A similar spike in productivity occurred shortly after GMOs were cultivated worldwide. The past five decades alone have seen a tremendous productivity spike: one worker in 2014 produced the same tonnage of produce as nearly six workers in the 1960s.<\/p>\n<p><img loading=\"lazy\" class=\"wp-image-9561 size-large aligncenter\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-09-at-2.41.59-PM-1024x573.png\" alt=\"Tech's impact on agriculture reveals that restaurant robots who replace workers could be a boon to QSRs.\" width=\"980\" height=\"548\" srcset=\"https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-09-at-2.41.59-PM-1024x573.png 1024w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-09-at-2.41.59-PM-350x196.png 350w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-09-at-2.41.59-PM-300x168.png 300w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-09-at-2.41.59-PM-768x430.png 768w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-09-at-2.41.59-PM-970x543.png 970w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-09-at-2.41.59-PM-500x280.png 500w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-09-at-2.41.59-PM-220x124.png 220w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-09-at-2.41.59-PM-160x90.png 160w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Screen-Shot-2017-01-09-at-2.41.59-PM.png 1912w\" sizes=\"(max-width: 980px) 100vw, 980px\" \/><\/p>\n<h2>Some Restaurant Chains are Already Reaping the Benefits of Automation<\/h2>\n<p>McDonald’s is rolling out digital self-order kiosks in all of its 14,000 U.S. stores. Wendy’s is making kiosks available to franchisees across its 6,000-plus units. At Panera, the use of kiosks has <a href=\"https:\/\/aaronallen.com\/blog\/restaurant-tech-investment\">shaved lifetimes off of customer waits<\/a>.<\/p>\n<p><img loading=\"lazy\" class=\"wp-image-9562 size-full aligncenter\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/01\/LSRQSR-kiosks.jpg\" alt=\"restaurant robots replace workers at QSR and LSR formats\" width=\"637\" height=\"183\" srcset=\"https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/LSRQSR-kiosks.jpg 637w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/LSRQSR-kiosks-350x101.jpg 350w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/LSRQSR-kiosks-300x86.jpg 300w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/LSRQSR-kiosks-500x144.jpg 500w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/LSRQSR-kiosks-220x63.jpg 220w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/LSRQSR-kiosks-160x46.jpg 160w\" sizes=\"(max-width: 637px) 100vw, 637px\" \/><\/p>\n<p>Eatsa, launched in 2015, relies solely on kiosks in lieu of front-of-house staff. Customers at eatsa never interact with a human employee, although unseen humans in the back of house prepare the food. According to the <a href=\"http:\/\/www.nytimes.com\/2015\/09\/09\/upshot\/restaurant-of-the-future-service-with-an-impersonal-touch.html?_r=0\">New York Times<\/a>, “there are plans to fully automate that process, too, if it can be done less expensively than employing people.”<\/p>\n<p>And then there are the chef-bots: robots that can assemble a pizza and pile toppings on a sandwich. The burger-flipping robots designed by Momentum Machines can produce 360 burgers per hour, even custom-grinding meat to order. Also, because they’re robots, they don’t carry the risk of norovirus.<\/p>\n<p>The widespread use of burger bots certainly won’t come overnight, though similar devices have already shown great potential. At Silicon Valley’s Zume Pizza, pies laden with hand-cured pepperoni, cheese, and organic veggies are assembled by both humans and robots, then baked in an automated oven or a van on their way to be delivered.<\/p>\n<h2>Consumers are Growing More Comfortable with Tech<\/h2>\n<p>Consumers are interested in where their food comes from, but maybe not quite ready to shake the hand of the robot baking it. That attitude is changing pretty rapidly, though.<\/p>\n<h3><img loading=\"lazy\" class=\"aligncenter size-full wp-image-9639\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/02\/McDonalds-line-wait-time-automation.jpg\" alt=\"McDonald's line wait time automation\" width=\"587\" height=\"197\" srcset=\"https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/02\/McDonalds-line-wait-time-automation.jpg 587w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/02\/McDonalds-line-wait-time-automation-350x117.jpg 350w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/02\/McDonalds-line-wait-time-automation-300x101.jpg 300w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/02\/McDonalds-line-wait-time-automation-500x168.jpg 500w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/02\/McDonalds-line-wait-time-automation-220x74.jpg 220w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/02\/McDonalds-line-wait-time-automation-160x54.jpg 160w\" sizes=\"(max-width: 587px) 100vw, 587px\" \/><\/h3>\n<p>In some cases, guests say they would rather use tech if it would save them a few minutes of standing in line. According to a study conducted by Tillster (the company behind both Burger King and Taco Bell&#8217;s apps), fast food customers spend about one-third of their visit just waiting for food. But only 36 percent of them say they would wait in a line at counter longer than five people. The other 64 percent would simply leave — unless the restaurant offered a kiosk, in which case respondents said they’d opt for that over a human worker.<\/p>\n<p>Let’s dig a bit deeper into that. The average fast-food transaction lasts 3 minutes and 23 seconds, one-third of which (1:07) is spent waiting for food. If a self-order kiosk could reduce wait time by just 15% (some companies claim time-savings of double that), this would save up to 10 seconds per transaction. For McDonald’s 14,000 U.S. locations, that equates to more than 13.6 million hours saved in the first year of kiosks being installed system-wide.<\/p>\n<p>Robots and self-serve kiosks tend to be more efficient, and better at upselling, than a human worker. People also tend to order more food from kiosks and apps than they would from a human. Orders made via Taco Bell&#8217;s digital app, for instance, are 20 percent higher than those taken by human cashiers.<\/p>\n<p><a href=\"https:\/\/aaronallen.com\/restaurant-technology\">Restaurant technology<\/a> can also tailor an experience to a particular guest or scenario. McDonald’s digital menu boards, for example, highlight breakfast items in the morning, and can even change based on rain or a cold snap.<\/p>\n<h2>Technology&#8217;s Positive Impact Extends Beyond the Front of House<\/h2>\n<p>The dialogue around automation has focused primarily on consumer-facing technology. But the benefits go beyond flashy, Jetsons-style robots. Automation will eventually give operators new ways to control and optimize every functional area of their operation.<\/p>\n<p>Software companies are continuously expanding their platforms to be a single point for unit-level managers and workers alike. Today, systems like HotSchedules allow employees to alter their schedules, make changes to their shifts, and communicate with managers and co-workers. When I Work, for instance, has generated $24 million in funding so far. By enabling more efficient scheduling, they keep employees happy and create labor savings.<\/p>\n<p>New tools in the pipeline aim to help restaurants make more informed decisions when determining supply chain sales. BlueCart, which has raised $4 million in funding, helps restaurants track their inventory and aggregate supplier orders.<\/p>\n<p>Burgeoning technologies also have the capacity to streamline hiring, restaurant real estate processes, inventory, and food preparation. A number of startups have developed digital platforms for restaurant marketing (Upserve, Fishbowl); customer loyalty (FiveStars, Belly); and even wi-wi (WiWide in China allows restaurants to analyze customer behavior by tracking who’s logging on and off).<\/p>\n<p>Analytics companies are also proving integral to chains, providing restaurant operators up-to-date benchmarks to competitors. Wherever man-hours can be reduced (or replaced) by automation, technology will find a way.<\/p>\n<h2>The Reward Outweighs the Risk<\/h2>\n<p>Technology does not often come cheaply, especially when it’s new. The good news is that new and more affordable systems are beginning to reach market maturity. Zume Pizzeria’s robots cost $3 million to develop, and company executives say new locations cost $750,000 &#8211; $1 million to launch. Once fully automated, the restaurant predicts its labor costs will be 14 percent of revenue, about half that of the competition.<\/p>\n<p><img loading=\"lazy\" class=\"aligncenter wp-image-9563 size-full\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/01\/Special-delivery.jpg\" alt=\"restaurant robots replace workers at pizza chains\" width=\"560\" height=\"187\" srcset=\"https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Special-delivery.jpg 560w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Special-delivery-350x117.jpg 350w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Special-delivery-300x100.jpg 300w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Special-delivery-500x167.jpg 500w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Special-delivery-220x73.jpg 220w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Special-delivery-160x53.jpg 160w\" sizes=\"(max-width: 560px) 100vw, 560px\" \/><\/p>\n<p>At Domino’s, a new location costs just $250,000 to $300,000 to launch. Pizza-making robots might not make much financial sense, but the Zume model of a pizza that bakes in an oven while en route to be delivered? Domino’s is already testing it.<\/p>\n<p>Technology is a rising tide, but that doesn’t mean it will lift the boat of those who are floundering. For chains that want to ensure relevance, shave dollars off labor costs, and create a dynamic experience in both the front and back-of-house, automation has proved more than compelling. The chains who are early to adopt the latest advances are the ones who will reap the largest benefits.<\/p>\n<h2>The Human Touch is Still an Integral Part of the Industry<\/h2>\n<p>If you can’t deliver an experience and skill that a robot can, well, you might have to step aside and reward robots that can do better. (In other words: If you don’t have more charisma than IBM&#8217;s Watson, well, you might be in danger of losing your job.)<\/p>\n<p>Those workers who are likely to be replaced will need to enhance their skills to focus on the valuable things a robot can’t do yet — things like critical thinking, expressing empathy, and adding a human touch to hospitality; while also embracing a world and workplace co-inhabited with robots, artificial intelligence, and the implications that come along with the Internet of Things (IoT).<\/p>\n<p>Tiptoeing around the fringes is no longer an option, especially if a brand wants to ensure relevance. Due to the fast pace of technology, restaurant chains must learn to deal with the specifics of today, and adapt to a quickly changing environment moving forward. It&#8217;s therefore incumbent upon companies to invest resources (both human and financial) toward adding a new pace and dynamic into their business. In a risk-averse, slow-moving industry like the restaurant business, technology adds that new dynamic.<\/p>\n<p>A robot will never have a human heart. It will never have a more authentic and genuine passion than its programmer dictated it should; and therefore its response may never truly be that much better than that of a well-mannered automated phone system. That&#8217;s why you can still find jobs, and humans still work better than robots.<\/p>\n<p>But building an incredible business isn’t only about how much additional margin can be squeezed and how systematized the automation can be. It’s also about how human a company can be — how it can relate to and empathize with employees and guests on not only a rational level, but in a caring and compassionate way. While a robot’s “brain” might work faster than a human’s, it’s the human touch that makes for a better corporate strategy, and also a better society.<\/p>\n<p>* * *<\/p>\n<h3>ABOUT AARON ALLEN &amp; ASSOCIATES:<\/h3>\n<p><a href=\"https:\/\/aaronallen.com\" target=\"_blank\" rel=\"nofollow noopener noreferrer\">Aaron Allen &amp; Associates<\/a> is a leading global restaurant industry consultancy specializing in growth strategy, marketing, branding, commercial due diligence for emerging restaurant chains and prestigious private equity firms. Aaron has personally lead boots-on-the-ground assignments in 68 countries. Collectively, his clients around the globe generate over $100 billion annually and span six continents and more than 100 countries.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The would-be U.S. Secretary of Labor can’t wait to see you replaced with a robot. Who could blame him? He has several good points. Robots never call in sick. They never complain. They work 24\/7 for pennies on the dollar. They’re as eager to please as any programmer can dream up and they think as fast as &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;A Robot Wants Your Job: How Automation Will Transform Foodservice&#8221;<\/span><\/a><\/p>\n","protected":false},"author":40,"featured_media":9643,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[1,7571],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.2 (Yoast SEO v19.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Will restaurant robots replace workers due to technology?<\/title>\n<meta name=\"description\" content=\"Restaurant operators are faced with a choice: bring technology into the business or have tech thrust on them. But will restaurant robots replace workers?\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"A Robot Wants Your Job: How Automation Will Transform Foodservice\" \/>\n<meta property=\"og:description\" content=\"The would-be U.S. Secretary of Labor can’t wait to see you replaced with a robot. Who could blame him? He has several good points. Robots never call in\" \/>\n<meta property=\"og:url\" content=\"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers\" \/>\n<meta property=\"og:site_name\" content=\"Aaron Allen &amp; Associates, Global Restaurant Consultants\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/\" \/>\n<meta property=\"article:published_time\" content=\"2017-02-15T16:44:36+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-07-29T17:30:56+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/02\/1487176122.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1094\" \/>\n\t<meta property=\"og:image:height\" content=\"362\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Aaron Allen\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@QMG\" \/>\n<meta name=\"twitter:site\" content=\"@QMG\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Aaron Allen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers#article\",\"isPartOf\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers\"},\"author\":{\"name\":\"Aaron Allen\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21\"},\"headline\":\"A Robot Wants Your Job: How Automation Will Transform Foodservice\",\"datePublished\":\"2017-02-15T16:44:36+00:00\",\"dateModified\":\"2022-07-29T17:30:56+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers\"},\"wordCount\":1782,\"publisher\":{\"@id\":\"https:\/\/aaronallen.com\/#organization\"},\"articleSection\":[\"Insights\",\"Restaurant Operations\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers\",\"url\":\"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers\",\"name\":\"Will restaurant robots replace workers due to technology?\",\"isPartOf\":{\"@id\":\"https:\/\/aaronallen.com\/#website\"},\"datePublished\":\"2017-02-15T16:44:36+00:00\",\"dateModified\":\"2022-07-29T17:30:56+00:00\",\"description\":\"Restaurant operators are faced with a choice: bring technology into the business or have tech thrust on them. But will restaurant robots replace workers?\",\"breadcrumb\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Aaron Allen\",\"item\":\"https:\/\/aaronallen.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Insights\",\"item\":\"https:\/\/aaronallen.com\/blog\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"A Robot Wants Your Job: How Automation Will Transform Foodservice\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/aaronallen.com\/#website\",\"url\":\"https:\/\/aaronallen.com\/\",\"name\":\"Aaron Allen & Associates | Global Restaurant Consultants\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/aaronallen.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/aaronallen.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/aaronallen.com\/#organization\",\"name\":\"Aaron Allen & Associates\",\"url\":\"https:\/\/aaronallen.com\/\",\"sameAs\":[\"https:\/\/www.linkedin.com\/company\/aaron-allen-&amp;-associates\",\"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/\",\"https:\/\/twitter.com\/QMG\"],\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png\",\"contentUrl\":\"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png\",\"width\":1247,\"height\":250,\"caption\":\"Aaron Allen & Associates\"},\"image\":{\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21\",\"name\":\"Aaron Allen\",\"sameAs\":[\"http:\/\/aaronallen.com\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Will restaurant robots replace workers due to technology?","description":"Restaurant operators are faced with a choice: bring technology into the business or have tech thrust on them. But will restaurant robots replace workers?","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers","og_locale":"en_US","og_type":"article","og_title":"A Robot Wants Your Job: How Automation Will Transform Foodservice","og_description":"The would-be U.S. Secretary of Labor can’t wait to see you replaced with a robot. Who could blame him? He has several good points. Robots never call in","og_url":"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers","og_site_name":"Aaron Allen &amp; Associates, Global Restaurant Consultants","article_publisher":"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/","article_published_time":"2017-02-15T16:44:36+00:00","article_modified_time":"2022-07-29T17:30:56+00:00","og_image":[{"width":1094,"height":362,"url":"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/02\/1487176122.jpg","type":"image\/jpeg"}],"author":"Aaron Allen","twitter_card":"summary_large_image","twitter_creator":"@QMG","twitter_site":"@QMG","twitter_misc":{"Written by":"Aaron Allen","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers#article","isPartOf":{"@id":"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers"},"author":{"name":"Aaron Allen","@id":"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21"},"headline":"A Robot Wants Your Job: How Automation Will Transform Foodservice","datePublished":"2017-02-15T16:44:36+00:00","dateModified":"2022-07-29T17:30:56+00:00","mainEntityOfPage":{"@id":"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers"},"wordCount":1782,"publisher":{"@id":"https:\/\/aaronallen.com\/#organization"},"articleSection":["Insights","Restaurant Operations"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers","url":"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers","name":"Will restaurant robots replace workers due to technology?","isPartOf":{"@id":"https:\/\/aaronallen.com\/#website"},"datePublished":"2017-02-15T16:44:36+00:00","dateModified":"2022-07-29T17:30:56+00:00","description":"Restaurant operators are faced with a choice: bring technology into the business or have tech thrust on them. But will restaurant robots replace workers?","breadcrumb":{"@id":"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/aaronallen.com\/blog\/restaurant-robots-replace-workers#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Aaron Allen","item":"https:\/\/aaronallen.com\/"},{"@type":"ListItem","position":2,"name":"Insights","item":"https:\/\/aaronallen.com\/blog"},{"@type":"ListItem","position":3,"name":"A Robot Wants Your Job: How Automation Will Transform Foodservice"}]},{"@type":"WebSite","@id":"https:\/\/aaronallen.com\/#website","url":"https:\/\/aaronallen.com\/","name":"Aaron Allen & Associates | Global Restaurant Consultants","description":"","publisher":{"@id":"https:\/\/aaronallen.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/aaronallen.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/aaronallen.com\/#organization","name":"Aaron Allen & Associates","url":"https:\/\/aaronallen.com\/","sameAs":["https:\/\/www.linkedin.com\/company\/aaron-allen-&amp;-associates","https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/","https:\/\/twitter.com\/QMG"],"logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/","url":"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png","contentUrl":"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png","width":1247,"height":250,"caption":"Aaron Allen & Associates"},"image":{"@id":"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21","name":"Aaron Allen","sameAs":["http:\/\/aaronallen.com"]}]}},"jetpack_featured_media_url":"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/02\/1487176122.jpg","amp_enabled":true,"_links":{"self":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts\/9542"}],"collection":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/users\/40"}],"replies":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/comments?post=9542"}],"version-history":[{"count":0,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts\/9542\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/media\/9643"}],"wp:attachment":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/media?parent=9542"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/categories?post=9542"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/tags?post=9542"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}