{"id":9579,"date":"2017-01-18T12:10:16","date_gmt":"2017-01-18T17:10:16","guid":{"rendered":"http:\/\/aaronallen.com\/?p=9579"},"modified":"2020-05-08T13:11:45","modified_gmt":"2020-05-08T18:11:45","slug":"restaurant-industry-innovation","status":"publish","type":"post","link":"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation","title":{"rendered":"The Greatest Show on Earth Folds Its Tent: Here&#8217;s the Restaurant Industry Lesson"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-post\" data-elementor-id=\"9579\" class=\"elementor elementor-9579\">\n\t\t\t\t\t\t<div class=\"elementor-inner\">\n\t\t\t\t<div class=\"elementor-section-wrap\">\n\t\t\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-6cbe7bac elementor-section-stretched elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"6cbe7bac\" data-element_type=\"section\" data-settings=\"{&quot;stretch_section&quot;:&quot;section-stretched&quot;}\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-13a830bb\" data-id=\"13a830bb\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-2a8efb26 elementor-widget elementor-widget-text-editor\" data-id=\"2a8efb26\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<style>\/*! elementor - v3.7.3 - 29-08-2022 *\/\n.elementor-widget-text-editor.elementor-drop-cap-view-stacked .elementor-drop-cap{background-color:#818a91;color:#fff}.elementor-widget-text-editor.elementor-drop-cap-view-framed .elementor-drop-cap{color:#818a91;border:3px solid;background-color:transparent}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap{margin-top:8px}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap-letter{width:1em;height:1em}.elementor-widget-text-editor .elementor-drop-cap{float:left;text-align:center;line-height:1;font-size:50px}.elementor-widget-text-editor .elementor-drop-cap-letter{display:inline-block}<\/style>\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\">\n\t\t\t\t<p><span style=\"font-weight: 400;\">At its height, Ringling Brothers-Barnum &amp; Bailey Circus embodied American entertainment. Over the span of its 146 years, its spirited ringmasters invited fans of all ages to take in both the jaw-dropping (lions, tightrope-walkers, trained elephants) and the eye-opening (strongmen, bearded ladies, trapeze artists). P.T. Barnum, the founder of what would eventually become the circus, was a true showman, delighting in the hoaxes and oddities that would eventually become his namesake.<\/span><\/p><p><span style=\"font-weight: 400;\">But in recent years, the Big Top felt a little deflated, the Greatest Show on Earth a little less great. The January announcement — that the Ringling Brothers circus would deliver its final show in 2017 — wasn’t entirely shocking. Billionaire CEO Kenneth Feld cited high operating costs and dwindling ticket sales as the primary issues, saying the circus simply “wasn’t a sustainable business model.” Even after recent makeovers, the show’s nostalgic appeal didn’t resonate with modern audiences. But perhaps even more detrimental to the circus, in the end, was the loss of its very essence.<\/span><\/p><p><span style=\"font-weight: 400;\">In 2005, it lost one part of its identity with the retirement of its three rings (the word “circus” is, after all, Latin for ring.) Ten years later the circus retired something else: its famous elephants, which Barnum himself had turned into stars. But although they were a storied part of the brand’s history, the rings and the elephants weren’t a requisite part of the circus. It was a failure to honor the brand’s DNA — to continue to spark the magic that resonated with audiences for over a century — that ultimately proved fatal.  <\/span><\/p><p><span style=\"font-weight: 400;\">Ringling Brothers’ failure serves as an important lesson for Casual Dining Restaurants, many of which are on the same path. Failure to modernize might hurt sales, but further clinging to the stale status quo could result in a final curtain call. <\/span><\/p><p><span style=\"font-weight: 400;\">Below, the biggest lessons restaurants can take from the once-Greatest Show on Earth:<\/span><\/p><h2>A PASSION FOR DECENCY RESONATES WITH CONSUMERS<\/h2><p><span style=\"font-weight: 400;\">In the 1990&#8217;s and 2000&#8217;s, Ringling was inundated with bad press that eventually eclipsed any of its positive PR efforts. By and large, circus-goers echoed the message of animal rights activists: You don’t have to be cruel to animals to have the Greatest Show on Earth. But the circus waited until 2015 to retire its elephants. That failure to respect the consumer and exhibit a passion for decency ended up being a contributing factor to its eventual demise. The former stars of the circus provide an interesting parallel to the restaurant industry: Did the elephant trainers think that what they were doing was bad? Probably no more so than those serving up bland, uninspired meals comprised of empty calories and lacking a novel experience. <\/span><\/p><p><span style=\"font-weight: 400;\">When you stand for something, you stand out. A <\/span><span style=\"font-weight: 400;\">brand promise<\/span><span style=\"font-weight: 400;\"> must be bold, clear, and made publicly. Everyone a brand deals with should know what the brand stands for (and what you won’t). Fast-casual salad chain sweet green burst onto the scene with its purpose-driven model of local, organic, and sustainable ingredients. Since its founding in 2007, the company has raised more than $95 million in funding — a testament that the brand&#8217;s message resonates with investors and consumers alike.<\/span><\/p><p><span style=\"font-weight: 400;\">It’s fallen on hard times since, but in 2010, Chipotle’s promise of “food with integrity” proved so compelling that the chain’s stock increased by 170%. Its popularity eventually paved the way for the fast-casual revolution, ushering in concepts like sweetgreen and Shake Shack.<\/span><\/p><h2>THE LOSS OF A FOUNDER DOESN’T HAVE TO MEAN A LOSS OF THE MAGIC<\/h2><p><span style=\"font-weight: 400;\">P.T. Barnum once said “the noblest art is that of making others happy.” It’s a tenet that’s ingrained in hospitality, but one that’s been lost at many Casual Dining Restaurants. When new leadership is put in place, brands often lose touch with their original magic. The strongest brands — a post-Walt Disney, or a post-Jobs Apple — carefully consider their DNA, even after their founder is gone.<\/span><\/p><p><span style=\"font-weight: 400;\">McDonald’s founder Ray Kroc’s high standards for quality, service, and cleanliness were notorious amongst those who worked for him. Kroc was even known to measure his restaurant’s French fries with a micrometer, to ensure they were all of exacting standards. No matter where a customer was, or what time of day, Kroc was determined that their meal would taste like it came from McDonald’s. The quest for consistency paid off, with McDonald’s becoming the most successful fast-food operation in the world. <\/span><\/p><p><span style=\"font-weight: 400;\">But its founder’s ethos has diminished a bit in recent years. When now-CEO Steve Easterbrook took the helm of the storied brand in 2015, he issued a turnaround plan aimed at unlocking financial value, driving operating growth, and creating brand excitement. But he did so by way of a complex matrix that barely cuts through and inspires the crew-level teams tasked with delivering on a CEO&#8217;s made-for-TV, microwaved turnaround plan. The plan was a drift from Kroc’s motto and, frankly, an over-complication of what initially propelled McDonald’s into one of the most consistent and admired restaurant companies in the world. <\/span><\/p><p><span style=\"font-weight: 400;\">The magic of the circus, for so many years, was that it was able to reinvent and reimagine its business model without abandoning its origins.<\/span><\/p><h2>BRANDS WHO THINK CREATIVELY CAN GET BACK TO THEIR ORIGINAL DNA WITHOUT COMPROMISING<\/h2><p><span style=\"font-weight: 400;\">CEO Feld has acknowledged the challenge of putting on a circus show in a modern era, saying: “In the past decade there’s been more change in the world than in the past 50 or 75 years prior to that. And I think it isn’t relevant to people in the same way.” It was as similar line of dialogue to one expressed by Steve Easterbrook in speaking about McDonald&#8217;s turnaround — though, Easterbrook seemed to have a better understanding of the fast pace of change. &#8220;In the last five years, the world has moved faster outside the business than inside,&#8221; he said. &#8220;The business cannot ignore what customers are saying when the message is clear: We&#8217;re not on our game.&#8221; In truth, disruptive technology is on an 18-month cycle. Waiting 50–75 years to evolve (or even five years, in the case of McDonald’s) is far too late.<\/span><\/p><p><span style=\"font-weight: 400;\">So, Feld attempted to modernize the circus by trading its controversial elephants for a tech-fueled spectacle — one with a storyline, ice, and pyrotechnics. What it lacked, however, was the sentiment of the Greatest Show on Earth and an aim to push the human experience even further. For Ringling, the revamp proved the equivalent of shuffling shelves at a pre-collapse Blockbuster. It might look a little different, but it’s still no Cirque du Soleil (or Netflix, as the case may be).<\/span><\/p><p><span style=\"font-weight: 400;\">The continued quest for relevance often puts brands at odds with their DNA. Applebee’s built a national brand by creating a “Neighborhood Bar and Grill.” But over the years, that morphed into national ad campaigns, and the same copycat menu items of its CDR peers — in short, anything that would stick. In losing that connection to local neighborhoods, the chain drifted from its core. In 2016, the company made headlines when it announced it had invested $75 million into installing wood-fired grills in all its restaurants. Real grills? At a chain with the word &#8220;grill&#8221; in its name? Genius! <\/span><\/p><p><span style=\"font-weight: 400;\">Brands who think creatively can deliver on their promises without compromising. Starbucks began as an espresso-maker and coffee bean purveyor before Howard Schultz transformed it into the European-style coffeehouse that has since grown to more than 24,000 locations worldwide. Even more compelling? Starbucks is on track to add 12,000 new locations in the next five years — something no restaurant chain has ever done before in that short of a time span. By comparison, it took Chipotle 24 years to reach 2,010 locations and Panera 36 years to reach 2,024.<\/span><\/p><h2>DON’T ASSUME IMMUNITY FROM FAILURE<\/h2><p><span style=\"font-weight: 400;\">Just two months before announcing its closure, Feld spoke confidently of the circus business, telling Forbes, “We’ll continue to evolve. That’s the future.” Unfortunately for him, that future proved not so bright. Innovation and evolution makes for a nice sound bite, but most lack the spine to really innovate. Instead, they look for the case study, the proper footprints to follow, in a shrinking category crowded with cowards. If something is<\/span><span style=\"font-weight: 400;\"> truly innovative, there won’t be a case study to follow. <\/span><\/p><p><span style=\"font-weight: 400;\">Faced with poor sales and traffic, many Casual Dining Restaurant Operators have placed the blame squarely on the market, pinning their plummeting revenues on a<\/span><a href=\"http:\/\/aaronallen.com\/blog\/restaurant-recession-2017\"> <span style=\"font-weight: 400;\">restaurant recession<\/span><\/a><span style=\"font-weight: 400;\">. For most of those chains, the real issue is changing consumer demographics and consumption patterns. While sales at CDRs are falling, use of meal kits, delivery services, and new styles of dining are rising.<\/span><\/p><p><span style=\"font-weight: 400;\">Even the biggest companies aren’t immune to failure, though hindsight tends to be 20\/20. In 2008, Blockbuster CEO Jim Keyes told a reporter that neither RedBox nor Netflix “are even on the radar screen in terms of competition.” Just two years later, his company filed for bankruptcy protection. Meanwhile, Netflix had become the second-largest video subscription service, second only to Comcast.<\/span><\/p><p><span style=\"font-weight: 400;\">Cirque du Soleil didn’t set out to compete with Ringling, instead they created a new market space, one that all but rendered Ringling irrelevant. While Ringling’s tickets ranged from $10 to $85, Cirque drew a new, more sophisticated audience — children, adults, a corporate audience willing to shell out $70 to $190 for a single ticket. The heightened experience didn&#8217;t even rely on a single elephant. It’s perhaps unsurprising, then, that Cirque du Soleil’s annual revenues exceed $810 million in less than 20 years since its founding — a number that took Ringling more than 100 years to achieve.<\/span><\/p><h2>THE MOST SUCCESSFUL BRANDS PUT THE EXPERIENCE FIRST<\/h2><p><span style=\"font-weight: 400;\">The Greatest Show on Earth never goes out of style. P.T. Barnum&#8217;s showmanship transformed the commodity of oddity into an astonishing experience. But over time, the circus fell into the trap of so many casual dining chains: clinging to the status quo in an effort to stay afloat, rather than honoring the magic, the spark, that dash of something different. Eventually, those chains find themselves sinking under the weight of the failure to refresh a stale <a href=\"http:\/\/aaronallen.com\/blog\/restaurant-brand-refresh\">restaurant brand<\/a>. <\/span><\/p><p><span style=\"font-weight: 400;\">Barnum’s real genius was in putting the experience first — connecting with his audience on a visceral level, and working backwards from there. It was a show worth seeing because no one had ever seen it before. It was a show worth seeing, because no one else had seen anything like it before.<\/span><\/p><p><span style=\"font-weight: 400;\">It’s a lesson that most restaurants in shrinking, less-relevant categories could certainly learn from. What makes a guest’s jaw drop and pulse quicken? What’s something our brand could do, that no one else is doing? How could we reimagine the future? Perhaps honoring a brand&#8217;s heritage and respecting what first propelled it would make for the greatest show on earth.<\/span><\/p><p>* * *<\/p><h3>ABOUT AARON ALLEN &amp; ASSOCIATES:<\/h3><p><a href=\"http:\/\/aaronallen.com\/\">Aaron Allen &amp; Associates<\/a> is a leading global restaurant industry consultancy specializing in growth strategy, marketing, branding, commercial due diligence for emerging restaurant chains and prestigious private equity firms. Aaron has personally lead boots-on-the-ground assignments in 68 countries for clients ranging from startups to multinational companies. Collectively, our clients around the globe generate over $200 billion annually and span six continents and more than 100 countries.<\/p><p><span style=\"font-family: arial, helvetica, sans-serif;\"> <\/span><\/p>\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>At its height, Ringling Brothers-Barnum &amp; Bailey Circus embodied American entertainment. Over the span of its 146 years, its spirited ringmasters invited fans of all ages to take in both the jaw-dropping (lions, tightrope-walkers, trained elephants) and the eye-opening (strongmen, bearded ladies, trapeze artists). P.T. Barnum, the founder of what would eventually become the circus, &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;The Greatest Show on Earth Folds Its Tent: Here&#8217;s the Restaurant Industry Lesson&#8221;<\/span><\/a><\/p>\n","protected":false},"author":40,"featured_media":11581,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[1,52],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.2 (Yoast SEO v19.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>Restaurant Industry Lessons From the Greatest Show on Earth<\/title>\n<meta name=\"description\" content=\"The lessons the restaurant industry can learn from the hype, showmanship — and ultimate failure — of the Greatest Show on Earth.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"The Greatest Show on Earth Folds Its Tent: Here&#039;s the Restaurant Industry Lesson\" \/>\n<meta property=\"og:description\" content=\"At its height, Ringling Brothers-Barnum &amp; Bailey Circus embodied American entertainment. Over the span of its 146 years, its spirited ringmasters\" \/>\n<meta property=\"og:url\" content=\"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation\" \/>\n<meta property=\"og:site_name\" content=\"Aaron Allen &amp; Associates, Global Restaurant Consultants\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/\" \/>\n<meta property=\"article:published_time\" content=\"2017-01-18T17:10:16+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-05-08T18:11:45+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/01\/Restaurant-Innovation-Failures.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"744\" \/>\n\t<meta property=\"og:image:height\" content=\"400\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Aaron Allen\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@QMG\" \/>\n<meta name=\"twitter:site\" content=\"@QMG\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Aaron Allen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"9 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation#article\",\"isPartOf\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation\"},\"author\":{\"name\":\"Aaron Allen\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21\"},\"headline\":\"The Greatest Show on Earth Folds Its Tent: Here&#8217;s the Restaurant Industry Lesson\",\"datePublished\":\"2017-01-18T17:10:16+00:00\",\"dateModified\":\"2020-05-08T18:11:45+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation\"},\"wordCount\":1897,\"publisher\":{\"@id\":\"https:\/\/aaronallen.com\/#organization\"},\"articleSection\":[\"Insights\",\"Restaurant Leadership\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation\",\"url\":\"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation\",\"name\":\"Restaurant Industry Lessons From the Greatest Show on Earth\",\"isPartOf\":{\"@id\":\"https:\/\/aaronallen.com\/#website\"},\"datePublished\":\"2017-01-18T17:10:16+00:00\",\"dateModified\":\"2020-05-08T18:11:45+00:00\",\"description\":\"The lessons the restaurant industry can learn from the hype, showmanship — and ultimate failure — of the Greatest Show on Earth.\",\"breadcrumb\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Aaron Allen\",\"item\":\"https:\/\/aaronallen.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Insights\",\"item\":\"https:\/\/aaronallen.com\/blog\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"The Greatest Show on Earth Folds Its Tent: Here&#8217;s the Restaurant Industry Lesson\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/aaronallen.com\/#website\",\"url\":\"https:\/\/aaronallen.com\/\",\"name\":\"Aaron Allen & Associates | Global Restaurant Consultants\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/aaronallen.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/aaronallen.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/aaronallen.com\/#organization\",\"name\":\"Aaron Allen & Associates\",\"url\":\"https:\/\/aaronallen.com\/\",\"sameAs\":[\"https:\/\/www.linkedin.com\/company\/aaron-allen-&amp;-associates\",\"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/\",\"https:\/\/twitter.com\/QMG\"],\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png\",\"contentUrl\":\"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png\",\"width\":1247,\"height\":250,\"caption\":\"Aaron Allen & Associates\"},\"image\":{\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21\",\"name\":\"Aaron Allen\",\"sameAs\":[\"http:\/\/aaronallen.com\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"Restaurant Industry Lessons From the Greatest Show on Earth","description":"The lessons the restaurant industry can learn from the hype, showmanship — and ultimate failure — of the Greatest Show on Earth.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation","og_locale":"en_US","og_type":"article","og_title":"The Greatest Show on Earth Folds Its Tent: Here's the Restaurant Industry Lesson","og_description":"At its height, Ringling Brothers-Barnum &amp; Bailey Circus embodied American entertainment. Over the span of its 146 years, its spirited ringmasters","og_url":"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation","og_site_name":"Aaron Allen &amp; Associates, Global Restaurant Consultants","article_publisher":"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/","article_published_time":"2017-01-18T17:10:16+00:00","article_modified_time":"2020-05-08T18:11:45+00:00","og_image":[{"width":744,"height":400,"url":"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/01\/Restaurant-Innovation-Failures.jpg","type":"image\/jpeg"}],"author":"Aaron Allen","twitter_card":"summary_large_image","twitter_creator":"@QMG","twitter_site":"@QMG","twitter_misc":{"Written by":"Aaron Allen","Est. reading time":"9 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation#article","isPartOf":{"@id":"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation"},"author":{"name":"Aaron Allen","@id":"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21"},"headline":"The Greatest Show on Earth Folds Its Tent: Here&#8217;s the Restaurant Industry Lesson","datePublished":"2017-01-18T17:10:16+00:00","dateModified":"2020-05-08T18:11:45+00:00","mainEntityOfPage":{"@id":"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation"},"wordCount":1897,"publisher":{"@id":"https:\/\/aaronallen.com\/#organization"},"articleSection":["Insights","Restaurant Leadership"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation","url":"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation","name":"Restaurant Industry Lessons From the Greatest Show on Earth","isPartOf":{"@id":"https:\/\/aaronallen.com\/#website"},"datePublished":"2017-01-18T17:10:16+00:00","dateModified":"2020-05-08T18:11:45+00:00","description":"The lessons the restaurant industry can learn from the hype, showmanship — and ultimate failure — of the Greatest Show on Earth.","breadcrumb":{"@id":"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/aaronallen.com\/blog\/restaurant-industry-innovation#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Aaron Allen","item":"https:\/\/aaronallen.com\/"},{"@type":"ListItem","position":2,"name":"Insights","item":"https:\/\/aaronallen.com\/blog"},{"@type":"ListItem","position":3,"name":"The Greatest Show on Earth Folds Its Tent: Here&#8217;s the Restaurant Industry Lesson"}]},{"@type":"WebSite","@id":"https:\/\/aaronallen.com\/#website","url":"https:\/\/aaronallen.com\/","name":"Aaron Allen & Associates | Global Restaurant Consultants","description":"","publisher":{"@id":"https:\/\/aaronallen.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/aaronallen.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/aaronallen.com\/#organization","name":"Aaron Allen & Associates","url":"https:\/\/aaronallen.com\/","sameAs":["https:\/\/www.linkedin.com\/company\/aaron-allen-&amp;-associates","https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/","https:\/\/twitter.com\/QMG"],"logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/","url":"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png","contentUrl":"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png","width":1247,"height":250,"caption":"Aaron Allen & Associates"},"image":{"@id":"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21","name":"Aaron Allen","sameAs":["http:\/\/aaronallen.com"]}]}},"jetpack_featured_media_url":"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/01\/Restaurant-Innovation-Failures.jpg","amp_enabled":true,"_links":{"self":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts\/9579"}],"collection":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/users\/40"}],"replies":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/comments?post=9579"}],"version-history":[{"count":0,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts\/9579\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/media\/11581"}],"wp:attachment":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/media?parent=9579"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/categories?post=9579"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/tags?post=9579"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}