{"id":9594,"date":"2017-01-26T16:44:38","date_gmt":"2017-01-26T21:44:38","guid":{"rendered":"http:\/\/aaronallen.com\/?p=9594"},"modified":"2020-03-11T10:46:43","modified_gmt":"2020-03-11T15:46:43","slug":"restaurant-marketing-budget-approved-ceo","status":"publish","type":"post","link":"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo","title":{"rendered":"How to Get Your Restaurant Marketing Budget Approved"},"content":{"rendered":"<p>The restaurant industry is an incredibly competitive one. While failure rates aren’t quite what has been claimed in some studies, the competitiveness has never been more intense. Emerging markets only add to that heightened competitive potency. (If you’re not convinced of that, read about the <a href=\"https:\/\/aaronallen.com\/blog\/restaurant-ceo\">25 things keeping restaurant CEOs awake at night<\/a>.) With so much change, devising a restaurant marketing budget grows more challenging by the day.<\/p>\n<p>In the past 8 years, marketing budgets have moved double-digit percentages from traditional media to new media and omni-channel type programs. Those numbers are anticipated to continue accelerating, leading marketing officers around the globe to look at new ways to market their brand — and attempt to convince their CEO to buy in to the idea.<\/p>\n<p>A Duke University poll of Chief Marketing Officers found that CMOs planned to increase their digital marketing spend by 14.7% over 2016, raising social media’s share of spend from 9.9% to 22.4% within the next five years. But a full 45% of those surveyed said they couldn’t actually demonstrate social media’s impact on their company performance. And it makes it difficult to convince a CEO to increase a restaurant marketing budget without proof that it will help the company in the long run. It might seem intimidating, but a few simple steps will ensure that a boss not only listens to your idea, but believes in it and approves it.<\/p>\n<h2>1. Ask Your Boss What&#8217;s Most Important to the Company<\/h2>\n<p>It’s easy to get caught up in the tactical, short-term, value-driven, shiny objects of the restaurant marketing world. Before you pitch&nbsp;a potentially harebrained idea to the company higher-ups, ensure that it’s well-thought-out and&nbsp;makes sense for the company. Marketing should be fun, but it also needs to be grounded in a strategic approach.<\/p>\n<p>Bandwagon-ing (“everybody’s doing it”) is often the most used tactic (which we’ll touch on a little later), but taking on a project just for the novelty factor isn’t practical. Don’t make assumptions about what a C-suite executive needs or wants, based solely on observations. Instead, ask questions — this will allow for a better understanding of your boss’ point of view and ultimately, create more opportunity for success — for both of you.<\/p>\n<p>Keep in mind that any new projects should be supportive of a brand’s foundation. Before any questions are asked, there should be documentation in place about what the company stands for: the brand’s promise, personality, positioning, and a well-articulated vision of its&nbsp;future. Any new projects&nbsp;should&nbsp;work to support&nbsp;those pillars of the company.<\/p>\n<p>Provided the brand promise&nbsp;is clear and documented, here are some other questions to ask:<\/p>\n<ul>\n<li>What’s most important to the company this year?<\/li>\n<li>What are our targets?<\/li>\n<li>Do we have any new restaurant openings?<\/li>\n<li>Are there going to be any substantive changes that will affect the employees or the guests (things like locations opening or closing, financial\/corporate restructuring)?<\/li>\n<li>What’s important to the CEO and to the company at large?<\/li>\n<li>What are my KPIs? How will you measure the performance of my department, my functional area, and my team?<\/li>\n<li>How does the company want to be known or perceived?<\/li>\n<\/ul>\n<h2>2. Show them the Money (&amp; the Visuals)<\/h2>\n<p>The most compelling case to a CEO will be one built on financial terms that aligns&nbsp;with greater strategic aims and company values. That means demonstrating how much a project will cost and how long it will take. But it also means showing that you’ve thought&nbsp;through the full scope of its potential impact on the budget and brand. Will this necessitate&nbsp;training or require new procedures? Will it alter stocking? How will it affect the&nbsp;supply chain?<\/p>\n<p>As you’re able to identify problems, also suggest solutions and fixes. Provide the rationale, and concisely explain how you arrived at your estimates. This will increase both your profile and likelihood that you’ll grow through the organization.<\/p>\n<p>For the busy CEO, visuals are key. Whomever you are going to present this to is a higher-up with multiple other competing priorities and demands — and far less bandwidth to consider a new project. Out of respect for their time, show it, don’t just say it. Provide bullet points, photographic evidence (including observations from the&nbsp;field, competitive insights, a usage case of in-store merchandising that isn’t working the right way, etc.) Visuals are key to demonstrating a larger point to someone who doesn’t have the time to read pages of documentation.<\/p>\n<h2>3. Use Stats, Case Studies<\/h2>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-9597\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/01\/Restaurant-Marketing-Copy-Cats-1024x281-1.jpg\" alt=\"restaurant marketing budget copycats \" width=\"980\" height=\"269\" srcset=\"https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Restaurant-Marketing-Copy-Cats-1024x281-1.jpg 1024w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Restaurant-Marketing-Copy-Cats-350x96.jpg 350w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Restaurant-Marketing-Copy-Cats-300x82.png 300w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Restaurant-Marketing-Copy-Cats-768x211-1.jpg 768w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Restaurant-Marketing-Copy-Cats-970x266-1.jpg 970w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Restaurant-Marketing-Copy-Cats-500x137-1.jpg 500w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Restaurant-Marketing-Copy-Cats-220x60-1.jpg 220w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Restaurant-Marketing-Copy-Cats-160x44-1.jpg 160w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Restaurant-Marketing-Copy-Cats.jpg 1475w\" sizes=\"(max-width: 980px) 100vw, 980px\" \/><\/p>\n<p>A great number of restaurant chains are guilty of jumping on the bandwagon — offering a similar value meal, or new menu item, as all of their competitors. If there are areas in which your organization is grossly behind, that doesn’t necessarily mean it’s the right thing for your brand. But providing examples is a good way of helping to nudge along a skeptical senior executive holding the purse strings.<\/p>\n<p>A strategic marketing approach (one focused on distributing valuable, relevant content) helps retain a clearly-defined audience and increases the overall value of a brand. Studies have shown that content marketing, for instance, costs 62% less that traditional marketing, but generates about three times as many engagements — a stat that would likely prove compelling to a restaurant CEO.<\/p>\n<p>Look to other industry benchmarks for proof, or at least a demonstration, of how investing in a new idea could help your organization maintain a competitive proposition. Gather examples — via social media, content marketing, improved ad campaigns, promotions, hiring of new people — to demonstrate how a project has proven successful among the competitive set. Benchmark against similar companies that have shown success in the area of interest, but keep in mind that simply copying a competitor isn’t exactly innovative. Case studies are helpful but true innovation never has footprints to follow.<\/p>\n<h2>4. Make Forecasts<\/h2>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-9595\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/01\/Marketing-Budget-Allocation-by-Area-1024x490.png\" alt=\"Restaurant marketing budget allocation\" width=\"980\" height=\"469\" srcset=\"https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Budget-Allocation-by-Area-1024x490.png 1024w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Budget-Allocation-by-Area-350x167.png 350w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Budget-Allocation-by-Area-300x144.png 300w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Budget-Allocation-by-Area-768x367.png 768w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Budget-Allocation-by-Area-970x464.png 970w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Budget-Allocation-by-Area-500x239.png 500w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Budget-Allocation-by-Area-220x105.png 220w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Budget-Allocation-by-Area-160x77.png 160w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Budget-Allocation-by-Area.png 1873w\" sizes=\"(max-width: 980px) 100vw, 980px\" \/><\/p>\n<p>The direction you’re facing is a sign of a maturing level of professionalism and responsibility. Typically, the lower end of an organization (the bookkeepers, for instance) are looking at what happened in the past. Meanwhile, the CEO will be forecasting quarters if not years out and planning capital investments that may stretch decades into the future.<\/p>\n<p>Focus not just on where the industry is now, but where it’s headed. In some cases, there won’t be a wealth of this industry-specific data in terms of clear budget breakdowns. However,&nbsp;forecasts from other industries can be helpful, as well. Don’t simply look at what the company has or hasn’t done. Examine the bigger picture: What’s actually shaping up to influence the industry and how can my organization shape that? Demonstrate that you&#8217;ve done your&nbsp;homework by&nbsp;supporting the case with stats and facts.<\/p>\n<h2>5. Compare &amp; Contrast<\/h2>\n<p>There are ways to test a hypothesis before pitching a big-budget, full-system rollout. Can you do A\/B split testing to validate some of your assumptions? A side-by-side comparison to see where your project stacks up to other benchmarks?<\/p>\n<p>Sixty-seven percent of marketers cite “increasing sales on digital marketing campaigns” as a top priority this year. Yet a third of marketers say they don’t know which digital tactic has the biggest revenue impact. (Nearly one in five small businesses don’t track their digital efforts at all.) So, if you can gather stats from competitors, you’re already ahead of the pack.<\/p>\n<h2>6. Think Like the CEO<\/h2>\n<p><img loading=\"lazy\" class=\"aligncenter size-large wp-image-9596\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/01\/Marketing-Strategy-Alignment-1024x273.png\" alt=\"restaurant marketing budget executives\" width=\"980\" height=\"261\" srcset=\"https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Strategy-Alignment-1024x273.png 1024w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Strategy-Alignment-350x93.png 350w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Strategy-Alignment-300x80.png 300w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Strategy-Alignment-768x205.png 768w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Strategy-Alignment-970x259.png 970w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Strategy-Alignment-500x133.png 500w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Strategy-Alignment-220x59.png 220w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Strategy-Alignment-160x43.png 160w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/01\/Marketing-Strategy-Alignment.png 1421w\" sizes=\"(max-width: 980px) 100vw, 980px\" \/><\/p>\n<p>Everyone has a boss, even your CEO, who likely answers to a board and investors. Get in their headspace before requesting approval of a big project. How would your CEO ask for a comparable budget? Likely, by demonstrating its potential impact areas: not just how much it costs but how much it’s going to make. You get extra points if you can demonstrate the internal rate of return and the hurdle of the IRR of investments.<\/p>\n<p>This means being short and succinct, but still offering a full explanation of a project&#8217;s impact in the long-term, and how it fits in to the larger structural goals and mandates of the CEO. Demonstrate that your recommendation links to an alignment of overarching corporate objectives, and you have a better chance of getting your budget approved — and doing the right thing for the company.<\/p>\n<h2>7. K.I.S.S.<\/h2>\n<p>Any document presented to a CEO should be self-sufficient. When presenting a case to a CEO, keep it short, simple, and don’t overcomplicate it. Provide pertinent details in a succinct manner, and wait to see if you’re asked questions. No questions could mean one of two things: Your proposal is being contemplated, or you’ve overstayed your welcome.<\/p>\n<p>You will likely have to put in a lot of work to pitch a project to a CEO. The&nbsp;deliverable itself, however, should be simple. This doesn’t mean it was easy to produce or simplistic, but that it’s easy-to-understand. Engineer your pitch in a way that takes into account the attention span needs of a C-suite audience. Be careful also in this regard. If you’ve just burned a lot of company time putting together a lofty plan, be conscious of that. A CEO likely won’t be too pleased if you chased a new project while forsaking something you were actually asked to do.<\/p>\n<p>In a way, it’s akin to engineering the guest experience at a restaurant. A lot of work has been put in to making the experience easier for the guest. But the end result makes the diner much more comfortable and at ease.<\/p>\n<h2>8. Lay It on the Line<\/h2>\n<p>Everyone should do work that they’re willing to take the fall for. A big opportunity for your company represents an opportunity for you and your career path as well.<\/p>\n<p>A high-stakes internal pitch may seem like a lot of work and a lot of risk for little payoff, but with risk comes reward. It’s how great ideas came to be, and how great companies have been formed. If something is worth doing, it’s worth doing well. If your great idea doesn&#8217;t resonate,&nbsp;either you have the wrong idea, or you’re in the wrong place.<\/p>\n<p>You never want to make a sloppy mistake. A mistake made in the pursuit of delivering something valuable&nbsp;to the organization, however, is a valiant and admirable failure. In fact, some organizations would consider that a strength. (But for starters, avoid these <a href=\"https:\/\/aaronallen.com\/blog\/common-restaurant-marketing-mistakes\">common marketing mistakes<\/a>.)<\/p>\n<h2>9. Call an Authority Figure<\/h2>\n<p>Sometimes the best ideas are already within a company — it’s just a matter of unlocking it.<\/p>\n<p>Often, it helps to have an unbiased, objective authority to pitch an idea. Some flash in the pan ideas don’t warrant making a strategic push, but others do. Keep in mind that your boss is under a lot of pressure to deliver. A third-party could give you a different understanding — and the CEO that extra push needed to okay the idea.<\/p>\n<p>Getting a CEO or executive leadership on board with a new marketing project isn’t exactly an easy task. But demonstrating how a marketing project can&nbsp;set a restaurant apart from its competitive set (and that it can be directly tied to business outcomes) ensures a CEO understands its full impact.<\/p>\n<p>Executive leadership wants to see&nbsp;that you’ve evaluated the landscape and know that the project is a good fit for the company. Once that&#8217;s been established, it&#8217;s easier to illustrate how a project&nbsp;fits in to the overall restaurant marketing budget. You’ll not only gain support from executives, but positive traction for the future of the company, and your own career.<\/p>\n<p>Innovation has become a buzzword and, while everyone talks about it,&nbsp;there’s only a small percentage that’s actually comfortable in that space. Whenever anyone undertakes something truly innovative, they&#8217;re bound to run in to adversity.&nbsp;It&#8217;s a powerful lesson and message for marketers. But it&#8217;s equally poignant for restaurant chains in a stale and stagnant state of being (which we see particularly pronounced in the <a href=\"https:\/\/aaronallen.com\/blog\/restaurant-recession-2017\">casual dining restaurant category<\/a>). The herd mentality is no longer safe.&nbsp;Those who take risks, and serve as an example of bravery amongst the status quo, will reap the largest rewards.<\/p>\n<p>* * *<\/p>\n<h3>About Aaron Allen &amp; Associates<\/h3>\n<p><a href=\"https:\/\/aaronallen.com\/\">Aaron Allen &amp; Associates<\/a>&nbsp;is a leading global restaurant industry consultancy specializing in growth strategy, marketing, branding, commercial due diligence for emerging restaurant chains and prestigious private equity firms. Aaron has personally lead boots-on-the-ground assignments in 70 countries for clients ranging from startups to multinational companies. Collectively, our clients around the globe generate over $200 billion annually and span six continents and more than 100 countries.<\/p>\n","protected":false},"excerpt":{"rendered":"<p>The restaurant industry is an incredibly competitive one. While failure rates aren’t quite what has been claimed in some studies, the competitiveness has never been more intense. Emerging markets only add to that heightened competitive potency. (If you’re not convinced of that, read about the 25 things keeping restaurant CEOs awake at night.) With so &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;How to Get Your Restaurant Marketing Budget Approved&#8221;<\/span><\/a><\/p>\n","protected":false},"author":40,"featured_media":0,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[1,49],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.2 (Yoast SEO v19.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Get Your Restaurant Marketing Budget Approved<\/title>\n<meta name=\"description\" content=\"Convincing a CEO to increase a restaurant marketing budget is not an easy task. A few simple steps ensure that a boss believes in your idea and approves it.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"How to Get Your Restaurant Marketing Budget Approved\" \/>\n<meta property=\"og:description\" content=\"The restaurant industry is an incredibly competitive one. While failure rates aren’t quite what has been claimed in some studies, the competitiveness has\" \/>\n<meta property=\"og:url\" content=\"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo\" \/>\n<meta property=\"og:site_name\" content=\"Aaron Allen &amp; Associates, Global Restaurant Consultants\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/\" \/>\n<meta property=\"article:published_time\" content=\"2017-01-26T21:44:38+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2020-03-11T15:46:43+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/01\/Restaurant-Marketing-Copy-Cats-1024x281-1.jpg\" \/>\n<meta name=\"author\" content=\"Aaron Allen\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@QMG\" \/>\n<meta name=\"twitter:site\" content=\"@QMG\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Aaron Allen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo#article\",\"isPartOf\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo\"},\"author\":{\"name\":\"Aaron Allen\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21\"},\"headline\":\"How to Get Your Restaurant Marketing Budget Approved\",\"datePublished\":\"2017-01-26T21:44:38+00:00\",\"dateModified\":\"2020-03-11T15:46:43+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo\"},\"wordCount\":2130,\"publisher\":{\"@id\":\"https:\/\/aaronallen.com\/#organization\"},\"articleSection\":[\"Insights\",\"Restaurant Marketing\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo\",\"url\":\"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo\",\"name\":\"How to Get Your Restaurant Marketing Budget Approved\",\"isPartOf\":{\"@id\":\"https:\/\/aaronallen.com\/#website\"},\"datePublished\":\"2017-01-26T21:44:38+00:00\",\"dateModified\":\"2020-03-11T15:46:43+00:00\",\"description\":\"Convincing a CEO to increase a restaurant marketing budget is not an easy task. A few simple steps ensure that a boss believes in your idea and approves it.\",\"breadcrumb\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Aaron Allen\",\"item\":\"https:\/\/aaronallen.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Insights\",\"item\":\"https:\/\/aaronallen.com\/blog\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"How to Get Your Restaurant Marketing Budget Approved\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/aaronallen.com\/#website\",\"url\":\"https:\/\/aaronallen.com\/\",\"name\":\"Aaron Allen & Associates | Global Restaurant Consultants\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/aaronallen.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/aaronallen.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/aaronallen.com\/#organization\",\"name\":\"Aaron Allen & Associates\",\"url\":\"https:\/\/aaronallen.com\/\",\"sameAs\":[\"https:\/\/www.linkedin.com\/company\/aaron-allen-&amp;-associates\",\"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/\",\"https:\/\/twitter.com\/QMG\"],\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png\",\"contentUrl\":\"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png\",\"width\":1247,\"height\":250,\"caption\":\"Aaron Allen & Associates\"},\"image\":{\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21\",\"name\":\"Aaron Allen\",\"sameAs\":[\"http:\/\/aaronallen.com\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"How to Get Your Restaurant Marketing Budget Approved","description":"Convincing a CEO to increase a restaurant marketing budget is not an easy task. A few simple steps ensure that a boss believes in your idea and approves it.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo","og_locale":"en_US","og_type":"article","og_title":"How to Get Your Restaurant Marketing Budget Approved","og_description":"The restaurant industry is an incredibly competitive one. While failure rates aren’t quite what has been claimed in some studies, the competitiveness has","og_url":"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo","og_site_name":"Aaron Allen &amp; Associates, Global Restaurant Consultants","article_publisher":"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/","article_published_time":"2017-01-26T21:44:38+00:00","article_modified_time":"2020-03-11T15:46:43+00:00","og_image":[{"url":"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/01\/Restaurant-Marketing-Copy-Cats-1024x281-1.jpg"}],"author":"Aaron Allen","twitter_card":"summary_large_image","twitter_creator":"@QMG","twitter_site":"@QMG","twitter_misc":{"Written by":"Aaron Allen","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo#article","isPartOf":{"@id":"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo"},"author":{"name":"Aaron Allen","@id":"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21"},"headline":"How to Get Your Restaurant Marketing Budget Approved","datePublished":"2017-01-26T21:44:38+00:00","dateModified":"2020-03-11T15:46:43+00:00","mainEntityOfPage":{"@id":"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo"},"wordCount":2130,"publisher":{"@id":"https:\/\/aaronallen.com\/#organization"},"articleSection":["Insights","Restaurant Marketing"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo","url":"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo","name":"How to Get Your Restaurant Marketing Budget Approved","isPartOf":{"@id":"https:\/\/aaronallen.com\/#website"},"datePublished":"2017-01-26T21:44:38+00:00","dateModified":"2020-03-11T15:46:43+00:00","description":"Convincing a CEO to increase a restaurant marketing budget is not an easy task. A few simple steps ensure that a boss believes in your idea and approves it.","breadcrumb":{"@id":"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Aaron Allen","item":"https:\/\/aaronallen.com\/"},{"@type":"ListItem","position":2,"name":"Insights","item":"https:\/\/aaronallen.com\/blog"},{"@type":"ListItem","position":3,"name":"How to Get Your Restaurant Marketing Budget Approved"}]},{"@type":"WebSite","@id":"https:\/\/aaronallen.com\/#website","url":"https:\/\/aaronallen.com\/","name":"Aaron Allen & Associates | Global Restaurant Consultants","description":"","publisher":{"@id":"https:\/\/aaronallen.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/aaronallen.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/aaronallen.com\/#organization","name":"Aaron Allen & Associates","url":"https:\/\/aaronallen.com\/","sameAs":["https:\/\/www.linkedin.com\/company\/aaron-allen-&amp;-associates","https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/","https:\/\/twitter.com\/QMG"],"logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/","url":"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png","contentUrl":"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png","width":1247,"height":250,"caption":"Aaron Allen & Associates"},"image":{"@id":"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21","name":"Aaron Allen","sameAs":["http:\/\/aaronallen.com"]}]}},"jetpack_featured_media_url":"","amp_enabled":true,"_links":{"self":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts\/9594"}],"collection":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/users\/40"}],"replies":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/comments?post=9594"}],"version-history":[{"count":0,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts\/9594\/revisions"}],"wp:attachment":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/media?parent=9594"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/categories?post=9594"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/tags?post=9594"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}