{"id":9675,"date":"2017-03-17T12:19:28","date_gmt":"2017-03-17T17:19:28","guid":{"rendered":"http:\/\/aaronallen.com\/?p=9675"},"modified":"2022-01-12T16:52:08","modified_gmt":"2022-01-12T22:52:08","slug":"what-to-do-when-sales-are-down","status":"publish","type":"post","link":"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down","title":{"rendered":"What to Do When Sales Are Down"},"content":{"rendered":"\t\t<div data-elementor-type=\"wp-post\" data-elementor-id=\"9675\" class=\"elementor elementor-9675\">\n\t\t\t\t\t\t<div class=\"elementor-inner\">\n\t\t\t\t<div class=\"elementor-section-wrap\">\n\t\t\t\t\t\t\t\t\t<section class=\"elementor-section elementor-top-section elementor-element elementor-element-2e1f2060 elementor-section-boxed elementor-section-height-default elementor-section-height-default\" data-id=\"2e1f2060\" data-element_type=\"section\">\n\t\t\t\t\t\t<div class=\"elementor-container elementor-column-gap-default\">\n\t\t\t\t\t\t\t<div class=\"elementor-row\">\n\t\t\t\t\t<div class=\"elementor-column elementor-col-100 elementor-top-column elementor-element elementor-element-55e64787\" data-id=\"55e64787\" data-element_type=\"column\">\n\t\t\t<div class=\"elementor-column-wrap elementor-element-populated\">\n\t\t\t\t\t\t\t<div class=\"elementor-widget-wrap\">\n\t\t\t\t\t\t<div class=\"elementor-element elementor-element-f301985 elementor-widget elementor-widget-text-editor\" data-id=\"f301985\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t<style>\/*! elementor - v3.7.3 - 29-08-2022 *\/\n.elementor-widget-text-editor.elementor-drop-cap-view-stacked .elementor-drop-cap{background-color:#818a91;color:#fff}.elementor-widget-text-editor.elementor-drop-cap-view-framed .elementor-drop-cap{color:#818a91;border:3px solid;background-color:transparent}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap{margin-top:8px}.elementor-widget-text-editor:not(.elementor-drop-cap-view-default) .elementor-drop-cap-letter{width:1em;height:1em}.elementor-widget-text-editor .elementor-drop-cap{float:left;text-align:center;line-height:1;font-size:50px}.elementor-widget-text-editor .elementor-drop-cap-letter{display:inline-block}<\/style>\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\">\n\t\t\t\t<p>Even the savviest executives find themselves plagued by the persistent, nagging feeling that comes with negative chain sales and traffic and how to grow a restaurant. Tonight, there will be dozens of CEOs who go to bed stressed out, worried about what the board will say after yet another down week.<\/p><p>Some might console themselves with the thought that it’s not <em>all<\/em> bad. Maybe the team did cut costs in some areas or are <em>almost<\/em> maintaining target margins. That might offer some comfort but, as Einstein said, a problem can’t be solved with the same line of thinking that created it.<\/p><p>While some restaurant chain sales are down, there are still operators whose sales are up — discouragement and disappointment are, therefore, only natural. For those looking to improve their company’s bottom line, rather than just keep track of it, the most powerful lever at their disposal just might be themselves (although some outside help never hurt).<\/p><p>For those ready to face the facts of negative sales — and work to overcome them — below are the first steps to take:<\/p><h2>1. Ask the Tough Questions <\/h2><p>If there’s a feeling of uncertainty about the counter-measures being deployed to freeze or reverse the decline in restaurant chain sales, it is probably not without reason. The $4 trillion global restaurant industry is one of the most competitive in the world. And many mature restaurant markets are saturated, with growth only coming at someone else’s expense.<\/p><p>In every down cycle, though, there’s still someone who’s up — someone who’s out-performing, out-maneuvering, out-competing. In other words: someone who’s stealing share of guests. The foodservice industry is still growing as a whole. And, to be fair, plenty of chains are down and are in the same boat. But it’s still important to ask the tough questions: Could I have done more? Can I do more? How much of this could be a failure of leadership to confront the tough problems and innovate our way out of the downturns?<\/p><h2>2. Do the Deep-Dive Due Diligence and Analysis<\/h2><p>Before determining <em>how<\/em> to get out of a mess, companies must first identify <em>why<\/em> they got into it in the first place. To again paraphrase Einstein, “If I had an hour to solve a problem, I’d spend 55 minutes thinking about the problem and five minutes thinking about solutions.” Identifying the root of the problem is often the hardest, but most crucial, step. To properly prescribe a solution, chains must be sure they’ve properly diagnosed the problem.<\/p><p>In such a complicated industry with many complexities a company and <a href=\"https:\/\/aaronallen.com\/blog\/restaurant-ceo\">CEO have to worry about<\/a>, gaining insight into a market and business itself is critical to identify the root cause of restaurant chain sales trends. Many chains think they already have analytics figured out, when they really just have backwards-facing P&amp;Ls and haphazardly assembled forward-looking forecasts. Therefore, they pin the blame on the most obvious culprits: the general economy, discretionary spending, or any of the other “out of our control” scapegoats. <\/p><p>So how do you grow a restaurant chain? For many operators — particularly those in the saturated or “copy-cat” categories — there’s a sense of denial and a mentality that chains can hurl themselves out of a problem with <a href=\"https:\/\/aaronallen.com\/blog\/23-restaurant-promotions-that-worked\">tactical promotions<\/a>.<\/p><p>Too often, chains seem to have lost their survival instincts and find themselves scared stiff from poor traffic, same-store-sales decreases, or a stale concept. As a result, they wind up making the same <a href=\"https:\/\/aaronallen.com\/blog\/common-restaurant-marketing-mistakes\">marketing mistakes<\/a> they’ve turned to time and again. Though they might see a slight (short-term) bump in sales, a dusty trunk of yesterday’s promotions won’t address the root cause of the problem, and are unlikely to lead to a company turnaround. The short-sighted quick-fixes can, however, lead to complacency and undermine the brand’s longevity.<\/p><p>Following the global financial crash, many casual dining restaurant (CDR) operators blamed their performance on the rise of fast casual, pointing fingers at the Chipotles and Paneras of the world. While this was certainly part of the story, there were also more underlying dynamics shifting the industry that were passed over. This is just one case of a symptom being falsely convicted as the underlying cause.<\/p><p>Intellectually rigorous analysis not contaminated by bias can help determine what’s truly causing the problem. Without good, solid, actionable, intelligence, restaurant chains will find themselves lost in a sea that’s gradually being filled with AI, IBM Watsons, and delivery bots.<\/p><p>When plagued by negative or slumping restaurant chain sales, it’s natural to look to cut corners every which way they can. But if the chain itself is down double-digits, saving a few dollars by cutting back on repairs and maintenance, and other short-term measures that can detract from the guest or employee experience in such a way that could be more detrimental than the savings it yields in the short term.<\/p><h2>3. Frame the Issues Both Internally and Externally <\/h2><p>We often read headlines declaring, “People are Going Out to Eat Less.” While that might be true for some categories and geographies, consumers are still going out to eat (even during a so-called <a href=\"https:\/\/aaronallen.com\/blog\/restaurant-recession-2017\">restaurant recession<\/a>). The chains that find success in even the downturns think about how to grow a restaurant by taking the time to look internally: at their people, products, processes, and physical environment — as well as externally, to their competitors.<\/p><p>Competitors may not be who comes to mind most obviously. New forms of dining are continually cropping up (food trucks, delivery, food ATMs), making seismic shifts in the industry, and siphoning off margins and mindshare from more traditional models. It’s important to take stock of the competition, and review what they’re doing — but not copy them. In fact, the key to salvation is often rooted in better differentiation, not frightened flock sensibilities.<\/p><p>Running a restaurant chain in the age of the fourth Industrial Revolution is not short on complications. We’ve worked with companies in nearly every corner of the globe, so we understand the shifting dynamics: the new categories, segments, cuisines, public\/private ownership types, franchisees\/franchisors, and so on. Today’s successful chains require a near-expert knowledge of globalization and localization (as well as a mindfulness of the impact of urbanization, mobile, digital, grocery, convenience, snacking occasion, shifting dayparts – the list goes on). The modern market complexities in what is already one of the most dynamic industries can quickly become overwhelming.<\/p><p>Just as a doctor must perform X-rays and tests to properly diagnose a patient, restaurant companies must invest in top-to-bottom analysis to properly diagnose their slumping sales. And while not as regulated as the medical profession, management has a responsibility to take measures to correctly identify the root causes of business issues before developing plans to address them.<\/p><h2>4. Develop a Phased Approach to Freeze\/Reverse Restaurant Chain Sales Declines<\/h2><p>The best advice is often the most obvious and in the case of slumping sales, it’s always important to get a second — objective — opinion. Before making permanent changes, challenge old assumptions. Make new ones, then challenge those, too, and refine them further.<\/p><p>As the old proverb goes, “Measure twice, cut once.” It’s challenging to discern exactly what is generating the best (or worst) return on investment if there are no solid goals or strategic plans in place. Aligning company objectives — cascaded down from an overarching strategic plan — is critical before making significant changes.<\/p><p>It’s easy to latch on to just a few disruptions in the industry that are making headlines. While delivery might be the hot button topic right now (and it is changing the industry dramatically), that does not mean it is the right strategy for <em>every<\/em> restaurant chain to employ.<\/p><p><a href=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/03\/1489692922.jpg\"><img loading=\"lazy\" class=\"aligncenter size-full wp-image-9677\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/03\/1489692922.jpg\" alt=\"\" width=\"1024\" height=\"548\" srcset=\"https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/1489692922.jpg 1024w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/1489692922-350x187.jpg 350w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/1489692922-300x161.png 300w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/1489692922-768x411-1.jpg 768w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/1489692922-970x519.png 970w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/1489692922-500x268.png 500w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/1489692922-220x118.png 220w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/1489692922-160x86.png 160w\" sizes=\"(max-width: 1024px) 100vw, 1024px\" \/><\/a><\/p><p>And while some chains move to jump on the trendiest bandwagon as fast as they can, others are so far behind they can’t see that the train’s already left the station. While Domino’s is rolling out delivery-via-Facebook\/Twitter\/Amazon Echo, there are thousands of restaurants that still lack even a basic website. Technology — <a href=\"https:\/\/aaronallen.com\/blog\/restaurant-delivery-growth\">restaurant delivery<\/a>, AI, and the Internet of Things — is forcing seismic shifts in the industry. Such an ever-evolving environment requires being more paranoid than less.<\/p><h2>5. How to Grow a Restaurant? Build Consensus.<\/h2><p>Not only does building consensus help contribute to and refine the ultimate response to a problem, but it builds company buy-in over simply announcing a plan. Every rollout should begin with gaining the support and understanding of the internal team, as studies have shown that people are five-to-one more committed to an initiative when they feel they’ve contributed to it in some way.<\/p><p>After gaining the support and influence of the team (who can add their own takes on the conclusions and offer advice), refine the plan, set budgets and timetables and seek a final authorization.<\/p><p><a href=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/03\/sales-down-McDonalds.jpg\"><img loading=\"lazy\" class=\"aligncenter size-full wp-image-9678\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/03\/sales-down-McDonalds.jpg\" alt=\"\" width=\"975\" height=\"218\" srcset=\"https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/sales-down-McDonalds.jpg 975w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/sales-down-McDonalds-350x78.jpg 350w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/sales-down-McDonalds-300x67.png 300w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/sales-down-McDonalds-768x172-1.jpg 768w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/sales-down-McDonalds-970x217-1.jpg 970w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/sales-down-McDonalds-500x112-1.jpg 500w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/sales-down-McDonalds-220x49-1.jpg 220w, https:\/\/11qkih2fw9d2h2oz31jff0fi-wpengine.netdna-ssl.com\/wp-content\/uploads\/2017\/03\/sales-down-McDonalds-160x36-1.jpg 160w\" sizes=\"(max-width: 975px) 100vw, 975px\" \/><\/a><\/p><p>Keep the following tips in mind when seeking approval for a plan (or even for a <a href=\"https:\/\/aaronallen.com\/blog\/restaurant-marketing-budget-approved-ceo\">marketing budget<\/a>):<\/p><ul><li>Simplify the plan, distilling it into a few key messages (because it’s easier to persuade someone of something’s importance when it’s relayed as a story).<\/li><li>Use powerful imagery. Iconography has always been a part of human culture and offers an effective way to get a point across.<\/li><li>Tie rewards to the company’s performance and value, to help stakeholders imagine what success could look like.<\/li><li>Enlist key stakeholders and ambassadors (agencies, product suppliers, experts from partner companies). People are five times more likely to be invested in a plan they feel they had a part in shaping.<\/li><\/ul><h2>6. Measure and Monitor<\/h2><p>Changing consumer preferences, the rise of social media, and continued economic uncertainty are putting pressure on many industries — and restaurants are certainly not exempt. Investing in technology to allow real-time insight into how a company is performing, minute by minute, has never been more important (especially following a big new rollout or project).<\/p><p>Throughout and after the rollout, measure Key Performance Indicators (KPIs) and utilize executive dashboards to gain insight into how the plan is impacting various aspects of the business. Companies can also monitor social channels, which offer an up-to-the-minute look at where guests and associates stand on any big brand changes.<\/p><p>Many companies (especially those in the restaurant business) aren’t crazy about change. But how can you grow a restaurant if unwilling to change? In thrive-to-survive industry, those who fail to evolve wind up several years behind their more modern counterparts. No modern television company would specialize in antennae-topped television sets, and yet modern restaurants proudly proclaim those same sorts of dated analytical capabilities as the tools for which they’re basing their decisions.<\/p><p><img loading=\"lazy\" class=\"aligncenter wp-image-9679\" src=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/03\/restaurant-sales.png\" alt=\"restaurant sales\" width=\"320\" height=\"377\" \/><\/p><h2>7. Analyze and Announce<\/h2><p>The decisions made when navigating out of a downturn can affect not only the P&amp;L statement, but also set off a ripple effect impacting people’s lives, both in and out of the organization. Analyze the impact (on guests, employees, and the bottom line) of a sales turnaround plan to take note of what worked, what didn’t, and why is an often-underemphasized step.<\/p><p>Did the tests and results offer a conclusive reason for the decline in sales? It’s not always possible to isolate each individual impact. But identifying which parts of the plan were successful and which did not yield as high of returns is exponentially helpful when evaluating the performance and determine which elements should be repeated or eliminated.<\/p><p>Examine performance variables to determine whether there were any patterns or anomalies. What should be repeated? What should be discontinued? What might require more (or less) investment?<\/p><p>Undertake a final debrief to document and archive the lessons learned, any results that were achieved, and plans moving forward. Share those results. Many on the team likely contributed to its implementation and want to know what resulted. Likewise, perhaps some team members deserve to be rewarded or recognized — as this ups the chances of them contributing expertise in the future. Studies have shown that happy workers — those who feel recognized — are more likely to solve difficult problems faster.<\/p><p>Finally, start back at the top, carrying any learnings into the next sequence in a phased approach. Keep mid- and long-range initiatives on a concurrent path with short-term objectives, and always honor the brand constitution and company vision along the way.<\/p><h2>Strategic Measures Will Ultimately Pay Off<\/h2><p>Undertaking short-term promotional measures (instead of taking the time to strategize and dig deeper into what might be contributing to sales failures) is the equivalent of playing business checkers when the reality is a much more strategic, yet swift-moving, game of chess.<\/p><p>Those who can face up to their problems and take measures to identify and address the root cause of their sales will be best equipped to forge ahead. In certain cases, the answers are hidden in plain sight — though they might require a fresh set of eyes to see them.<\/p><h2>How to Grow a Restaurant: Frequently Asked Questions<\/h2>\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<div class=\"elementor-element elementor-element-041ca24 uael-faq-box-layout-yes align-at-left elementor-widget elementor-widget-uael-faq\" data-id=\"041ca24\" data-element_type=\"widget\" data-widget_type=\"uael-faq.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\n\t\t\t<div id='uael-faq-wrapper-431' class=\"uael-faq-wrapper\">\n\t\t\t\t<div class=\"uael-faq-container uael-faq-layout-accordion\" data-layout=\"accordion\" >\n\t\t\t\t\t\t\t\t\t\t\t\t<div id=\"uael-accordion-d0de76d\" class=\"uael-faq-accordion\" role=\"tablist\">\n\t\t\t\t\t\t\t\t<div class= \"uael-accordion-title\" aria-expanded=\"false\" role=\"tab\">\n\t\t\t\t\t\t\t\t\t<span class=\"uael-accordion-icon uael-accordion-icon-left\">\n\t\t\t\t\t\t\t\t\t\t<span class=\"uael-accordion-icon-closed\"><i class=\"fas fa-angle-right\"><\/i><\/span>\n\t\t\t\t\t\t\t\t\t\t<span class=\"uael-accordion-icon-opened\"><i class=\"fas fa-angle-up\"><\/i><\/span>\n\t\t\t\t\t\t\t\t\t<\/span>\n\t\t\t\t\t\t\t\t\t<span class=\"uael-question-d0de76d uael-question-span\" tabindex=\"0\" id=\"uael-faq-1\">What is restaurant revenue?<\/span>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t\t\t<div class=\"uael-accordion-content\" role=\"tabpanel\">\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<span>Lorem ipsum dolor sit amet, consectetur adipiscing elit. Ut elit tellus, luctus nec ullamcorper mattis, pulvinar dapibus leo.<\/span>\t\t\t\t\t\t\t\t\t<\/span>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div id=\"uael-accordion-706b6c7\" class=\"uael-faq-accordion\" role=\"tablist\">\n\t\t\t\t\t\t\t\t<div class= \"uael-accordion-title\" aria-expanded=\"false\" role=\"tab\">\n\t\t\t\t\t\t\t\t\t<span class=\"uael-accordion-icon uael-accordion-icon-left\">\n\t\t\t\t\t\t\t\t\t\t<span class=\"uael-accordion-icon-closed\"><i class=\"fas fa-angle-right\"><\/i><\/span>\n\t\t\t\t\t\t\t\t\t\t<span class=\"uael-accordion-icon-opened\"><i class=\"fas fa-angle-up\"><\/i><\/span>\n\t\t\t\t\t\t\t\t\t<\/span>\n\t\t\t\t\t\t\t\t\t<span class=\"uael-question-706b6c7 uael-question-span\" tabindex=\"0\" id=\"uael-faq-2\">What's the average restaurant revenue?<\/span>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t\t\t<div class=\"uael-accordion-content\" role=\"tabpanel\">\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<span><p>The average restaurant revenue is around $1.3 million (in the U.S., based on the top 500 chains). There is a wide variability depending on category and format. For example, on the higher side, the average restaurant revenue is around $3.3 million for full-service chains such as Chili’s, BJ’s, or Cheddar’s. Pizza chains such as Pizza Hut and Little Caesar’s have an average revenue per restaurant of $800k.<\/p><\/span>\t\t\t\t\t\t\t\t\t<\/span>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t\t\t\t\t\t\t\t\t<div id=\"uael-accordion-7bac061\" class=\"uael-faq-accordion\" role=\"tablist\">\n\t\t\t\t\t\t\t\t<div class= \"uael-accordion-title\" aria-expanded=\"false\" role=\"tab\">\n\t\t\t\t\t\t\t\t\t<span class=\"uael-accordion-icon uael-accordion-icon-left\">\n\t\t\t\t\t\t\t\t\t\t<span class=\"uael-accordion-icon-closed\"><i class=\"fas fa-angle-right\"><\/i><\/span>\n\t\t\t\t\t\t\t\t\t\t<span class=\"uael-accordion-icon-opened\"><i class=\"fas fa-angle-up\"><\/i><\/span>\n\t\t\t\t\t\t\t\t\t<\/span>\n\t\t\t\t\t\t\t\t\t<span class=\"uael-question-7bac061 uael-question-span\" tabindex=\"0\" id=\"uael-faq-3\">How to grow a restaurant in simple steps?<\/span>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t\t\t<div class=\"uael-accordion-content\" role=\"tabpanel\">\n\t\t\t\t\t\t\t\t\t<span>\n\t\t\t\t\t\t\t\t\t<span><p>It can <\/p><ol><li>Know the market landscape. Are you losing to a competitor?<\/li><li>2 – Do your diligence to identify the root problem. You can’t manage what you can’t measure. Analytics are key in this step.<\/li><li>3 – Frame internal (people, product, processes, physical environment) and external issues (obvious and non-obvious competitors).<\/li><li>4 – Employ a three-horizon framework to tackle the problems and define concurrent paths.<\/li><li>5 – Gain broad stakeholder support<\/li><\/ol><\/span>\t\t\t\t\t\t\t\t\t<\/span>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t<div class=\"elementor-element elementor-element-6b71402 elementor-widget elementor-widget-text-editor\" data-id=\"6b71402\" data-element_type=\"widget\" data-widget_type=\"text-editor.default\">\n\t\t\t\t<div class=\"elementor-widget-container\">\n\t\t\t\t\t\t\t\t<div class=\"elementor-text-editor elementor-clearfix\">\n\t\t\t\t<h5>About Aaron Allen &amp; Associates <\/h5><p><a href=\"https:\/\/aaronallen.com\/\">Aaron Allen &amp; Associates<\/a> is a leading global restaurant industry consultancy specializing in <a href=\"https:\/\/aaronallen.com\/restaurant-research\" target=\"_blank\" rel=\"noopener\">research<\/a>, analytics, <a href=\"https:\/\/aaronallen.com\/growth-and-expansion\" target=\"_blank\" rel=\"noopener\">growth strategy<\/a>, marketing, branding, and <a href=\"https:\/\/aaronallen.com\/services\/restaurant-due-diligence\">due diligence<\/a> for emerging restaurant chains and prestigious private equity firms. <a href=\"https:\/\/www.linkedin.com\/in\/aarondallen\/detail\/recent-activity\/\">Aaron<\/a> has personally led boots-on-the-ground assignments in 68 countries. Collectively, the firm&#8217;s clients around the globe generate over $200 billion annually and span six continents and more than 100 countries.<\/p>\t\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t<\/div>\n\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/div>\n\t\t\t\t\t\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t<\/section>\n\t\t\t\t\t\t\t\t\t<\/div>\n\t\t\t<\/div>\n\t\t\t\t\t<\/div>\n\t\t","protected":false},"excerpt":{"rendered":"<p>Even the savviest executives find themselves plagued by the persistent, nagging feeling that comes with negative chain sales and traffic and how to grow a restaurant. Tonight, there will be dozens of CEOs who go to bed stressed out, worried about what the board will say after yet another down week. Some might console themselves &hellip; <\/p>\n<p class=\"link-more\"><a href=\"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down\" class=\"more-link\">Continue reading<span class=\"screen-reader-text\"> &#8220;What to Do When Sales Are Down&#8221;<\/span><\/a><\/p>\n","protected":false},"author":40,"featured_media":14394,"comment_status":"closed","ping_status":"closed","sticky":false,"template":"","format":"standard","meta":{"_mi_skip_tracking":false},"categories":[1,52],"tags":[],"yoast_head":"<!-- This site is optimized with the Yoast SEO Premium plugin v19.2 (Yoast SEO v19.6) - https:\/\/yoast.com\/wordpress\/plugins\/seo\/ -->\n<title>How to Grow a Restaurant: What to Do When Sales are Down<\/title>\n<meta name=\"description\" content=\"Dozens of CEOs will go to bed stressed out wondering about how to grow a restaurant chain&#039;s sales. Here&#039;s what to do when sales are down.\" \/>\n<meta name=\"robots\" content=\"index, follow, max-snippet:-1, max-image-preview:large, max-video-preview:-1\" \/>\n<link rel=\"canonical\" href=\"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down\" \/>\n<meta property=\"og:locale\" content=\"en_US\" \/>\n<meta property=\"og:type\" content=\"article\" \/>\n<meta property=\"og:title\" content=\"What to Do When Sales Are Down\" \/>\n<meta property=\"og:description\" content=\"Even the savviest executives find themselves plagued by the persistent, nagging feeling that comes with negative chain sales and traffic and how to grow a\" \/>\n<meta property=\"og:url\" content=\"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down\" \/>\n<meta property=\"og:site_name\" content=\"Aaron Allen &amp; Associates, Global Restaurant Consultants\" \/>\n<meta property=\"article:publisher\" content=\"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/\" \/>\n<meta property=\"article:published_time\" content=\"2017-03-17T17:19:28+00:00\" \/>\n<meta property=\"article:modified_time\" content=\"2022-01-12T22:52:08+00:00\" \/>\n<meta property=\"og:image\" content=\"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/03\/how-to-increase-restaurant-sales.jpg\" \/>\n\t<meta property=\"og:image:width\" content=\"1314\" \/>\n\t<meta property=\"og:image:height\" content=\"434\" \/>\n\t<meta property=\"og:image:type\" content=\"image\/jpeg\" \/>\n<meta name=\"author\" content=\"Aaron Allen\" \/>\n<meta name=\"twitter:card\" content=\"summary_large_image\" \/>\n<meta name=\"twitter:creator\" content=\"@QMG\" \/>\n<meta name=\"twitter:site\" content=\"@QMG\" \/>\n<meta name=\"twitter:label1\" content=\"Written by\" \/>\n\t<meta name=\"twitter:data1\" content=\"Aaron Allen\" \/>\n\t<meta name=\"twitter:label2\" content=\"Est. reading time\" \/>\n\t<meta name=\"twitter:data2\" content=\"11 minutes\" \/>\n<script type=\"application\/ld+json\" class=\"yoast-schema-graph\">{\"@context\":\"https:\/\/schema.org\",\"@graph\":[{\"@type\":\"Article\",\"@id\":\"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down#article\",\"isPartOf\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down\"},\"author\":{\"name\":\"Aaron Allen\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21\"},\"headline\":\"What to Do When Sales Are Down\",\"datePublished\":\"2017-03-17T17:19:28+00:00\",\"dateModified\":\"2022-01-12T22:52:08+00:00\",\"mainEntityOfPage\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down\"},\"wordCount\":2397,\"publisher\":{\"@id\":\"https:\/\/aaronallen.com\/#organization\"},\"articleSection\":[\"Insights\",\"Restaurant Leadership\"],\"inLanguage\":\"en-US\"},{\"@type\":\"WebPage\",\"@id\":\"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down\",\"url\":\"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down\",\"name\":\"How to Grow a Restaurant: What to Do When Sales are Down\",\"isPartOf\":{\"@id\":\"https:\/\/aaronallen.com\/#website\"},\"datePublished\":\"2017-03-17T17:19:28+00:00\",\"dateModified\":\"2022-01-12T22:52:08+00:00\",\"description\":\"Dozens of CEOs will go to bed stressed out wondering about how to grow a restaurant chain's sales. Here's what to do when sales are down.\",\"breadcrumb\":{\"@id\":\"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down#breadcrumb\"},\"inLanguage\":\"en-US\",\"potentialAction\":[{\"@type\":\"ReadAction\",\"target\":[\"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down\"]}]},{\"@type\":\"BreadcrumbList\",\"@id\":\"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down#breadcrumb\",\"itemListElement\":[{\"@type\":\"ListItem\",\"position\":1,\"name\":\"Aaron Allen\",\"item\":\"https:\/\/aaronallen.com\/\"},{\"@type\":\"ListItem\",\"position\":2,\"name\":\"Insights\",\"item\":\"https:\/\/aaronallen.com\/blog\"},{\"@type\":\"ListItem\",\"position\":3,\"name\":\"What to Do When Sales Are Down\"}]},{\"@type\":\"WebSite\",\"@id\":\"https:\/\/aaronallen.com\/#website\",\"url\":\"https:\/\/aaronallen.com\/\",\"name\":\"Aaron Allen & Associates | Global Restaurant Consultants\",\"description\":\"\",\"publisher\":{\"@id\":\"https:\/\/aaronallen.com\/#organization\"},\"potentialAction\":[{\"@type\":\"SearchAction\",\"target\":{\"@type\":\"EntryPoint\",\"urlTemplate\":\"https:\/\/aaronallen.com\/?s={search_term_string}\"},\"query-input\":\"required name=search_term_string\"}],\"inLanguage\":\"en-US\"},{\"@type\":\"Organization\",\"@id\":\"https:\/\/aaronallen.com\/#organization\",\"name\":\"Aaron Allen & Associates\",\"url\":\"https:\/\/aaronallen.com\/\",\"sameAs\":[\"https:\/\/www.linkedin.com\/company\/aaron-allen-&amp;-associates\",\"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/\",\"https:\/\/twitter.com\/QMG\"],\"logo\":{\"@type\":\"ImageObject\",\"inLanguage\":\"en-US\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/\",\"url\":\"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png\",\"contentUrl\":\"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png\",\"width\":1247,\"height\":250,\"caption\":\"Aaron Allen & Associates\"},\"image\":{\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/\"}},{\"@type\":\"Person\",\"@id\":\"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21\",\"name\":\"Aaron Allen\",\"sameAs\":[\"http:\/\/aaronallen.com\"]}]}<\/script>\n<!-- \/ Yoast SEO Premium plugin. -->","yoast_head_json":{"title":"How to Grow a Restaurant: What to Do When Sales are Down","description":"Dozens of CEOs will go to bed stressed out wondering about how to grow a restaurant chain's sales. Here's what to do when sales are down.","robots":{"index":"index","follow":"follow","max-snippet":"max-snippet:-1","max-image-preview":"max-image-preview:large","max-video-preview":"max-video-preview:-1"},"canonical":"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down","og_locale":"en_US","og_type":"article","og_title":"What to Do When Sales Are Down","og_description":"Even the savviest executives find themselves plagued by the persistent, nagging feeling that comes with negative chain sales and traffic and how to grow a","og_url":"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down","og_site_name":"Aaron Allen &amp; Associates, Global Restaurant Consultants","article_publisher":"https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/","article_published_time":"2017-03-17T17:19:28+00:00","article_modified_time":"2022-01-12T22:52:08+00:00","og_image":[{"width":1314,"height":434,"url":"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/03\/how-to-increase-restaurant-sales.jpg","type":"image\/jpeg"}],"author":"Aaron Allen","twitter_card":"summary_large_image","twitter_creator":"@QMG","twitter_site":"@QMG","twitter_misc":{"Written by":"Aaron Allen","Est. reading time":"11 minutes"},"schema":{"@context":"https:\/\/schema.org","@graph":[{"@type":"Article","@id":"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down#article","isPartOf":{"@id":"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down"},"author":{"name":"Aaron Allen","@id":"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21"},"headline":"What to Do When Sales Are Down","datePublished":"2017-03-17T17:19:28+00:00","dateModified":"2022-01-12T22:52:08+00:00","mainEntityOfPage":{"@id":"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down"},"wordCount":2397,"publisher":{"@id":"https:\/\/aaronallen.com\/#organization"},"articleSection":["Insights","Restaurant Leadership"],"inLanguage":"en-US"},{"@type":"WebPage","@id":"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down","url":"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down","name":"How to Grow a Restaurant: What to Do When Sales are Down","isPartOf":{"@id":"https:\/\/aaronallen.com\/#website"},"datePublished":"2017-03-17T17:19:28+00:00","dateModified":"2022-01-12T22:52:08+00:00","description":"Dozens of CEOs will go to bed stressed out wondering about how to grow a restaurant chain's sales. Here's what to do when sales are down.","breadcrumb":{"@id":"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down#breadcrumb"},"inLanguage":"en-US","potentialAction":[{"@type":"ReadAction","target":["https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down"]}]},{"@type":"BreadcrumbList","@id":"https:\/\/aaronallen.com\/blog\/what-to-do-when-sales-are-down#breadcrumb","itemListElement":[{"@type":"ListItem","position":1,"name":"Aaron Allen","item":"https:\/\/aaronallen.com\/"},{"@type":"ListItem","position":2,"name":"Insights","item":"https:\/\/aaronallen.com\/blog"},{"@type":"ListItem","position":3,"name":"What to Do When Sales Are Down"}]},{"@type":"WebSite","@id":"https:\/\/aaronallen.com\/#website","url":"https:\/\/aaronallen.com\/","name":"Aaron Allen & Associates | Global Restaurant Consultants","description":"","publisher":{"@id":"https:\/\/aaronallen.com\/#organization"},"potentialAction":[{"@type":"SearchAction","target":{"@type":"EntryPoint","urlTemplate":"https:\/\/aaronallen.com\/?s={search_term_string}"},"query-input":"required name=search_term_string"}],"inLanguage":"en-US"},{"@type":"Organization","@id":"https:\/\/aaronallen.com\/#organization","name":"Aaron Allen & Associates","url":"https:\/\/aaronallen.com\/","sameAs":["https:\/\/www.linkedin.com\/company\/aaron-allen-&amp;-associates","https:\/\/www.facebook.com\/aaron.allen.restaurant.consultant\/","https:\/\/twitter.com\/QMG"],"logo":{"@type":"ImageObject","inLanguage":"en-US","@id":"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/","url":"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png","contentUrl":"https:\/\/media.aaronallen.com\/dfR7U5E-ud4PezDj\/w:1247\/h:250\/q:75\/https:\/\/aaronallen.com\/wp-content\/uploads\/2018\/08\/aaron-allen-global-restaurant-consultants.png","width":1247,"height":250,"caption":"Aaron Allen & Associates"},"image":{"@id":"https:\/\/aaronallen.com\/#\/schema\/logo\/image\/"}},{"@type":"Person","@id":"https:\/\/aaronallen.com\/#\/schema\/person\/6166d58da5dd756a6da8d58b03cfcf21","name":"Aaron Allen","sameAs":["http:\/\/aaronallen.com"]}]}},"jetpack_featured_media_url":"https:\/\/aaronallen.com\/wp-content\/uploads\/2017\/03\/how-to-increase-restaurant-sales.jpg","amp_enabled":true,"_links":{"self":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts\/9675"}],"collection":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/users\/40"}],"replies":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/comments?post=9675"}],"version-history":[{"count":0,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/posts\/9675\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/media\/14394"}],"wp:attachment":[{"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/media?parent=9675"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/categories?post=9675"},{"taxonomy":"post_tag","embeddable":true,"href":"https:\/\/aaronallen.com\/wp-json\/wp\/v2\/tags?post=9675"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}